Manish-Subedi/embedded_Iot_project/ventilation_system/Debug/LPC15xx_peripheral.xml
	</registers>
		</peripheral>

		<peripheral>
	<name>DMA</name>
	<description>DMA controller</description>
	<groupName>DMA</groupName>
	<baseAddress>0x1C004000</baseAddress>
	<addressBlock>
	<offset>0x0</offset>
	<size>0xFFF</size>
	<usage>registers</usage>
	</addressBlock>
	<interrupt>
	<name>DMA</name>
	<value>4</value>
	</interrupt>
	<registers>

			<register>
				<name>CTRL</name>
				<description>DMA control.</description>
				<addressOffset>0x000</addressOffset>
				<access>read-write</access>
				<resetValue>0</resetValue>
				<resetMask>0xFFFFFFFF</resetMask>
				<fields>
					<field>
						<name>ENABLE</name>
						<description>DMA controller master enable.</description>
						<bitRange>[0:0]</bitRange>
						<enumeratedValues>
							<name>ENUM</name>
							<enumeratedValue>
								<name>DISABLED</name>
								<description>Disabled. The DMA controller is disabled. This clears any triggers that were asserted at the point when disabled, but does not prevent re-triggering when the DMA controller is re-enabled.</description>
								<value>0</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>ENABLED</name>
								<description>Enabled. The DMA controller is enabled.</description>
								<value>1</value>
							</enumeratedValue>
						</enumeratedValues>
					</field>
					<field>
						<name>RESERVED</name>
						<description>Reserved. Read value is undefined, only zero should be written.</description>
						<bitRange>[31:1]</bitRange>

					</field>
				</fields>
			</register>


		<register>
			<name>INTSTAT</name>
			<description>Interrupt status.</description>
			<addressOffset>0x004</addressOffset>
			<access>read-only</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Read value is undefined, only zero should be written.</description>
					<bitRange>[0:0]</bitRange>

				</field>
				<field>
					<name>ACTIVEINT</name>
					<description>Summarizes whether any enabled interrupts are pending.</description>
					<bitRange>[1:1]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>NOT_PENDING</name>
							<description>Not pending. No enabled interrupts are pending.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>PENDING</name>
							<description>Pending. At least one enabled interrupt is pending.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>ACTIVEERRINT</name>
					<description>Summarizes whether any error interrupts are pending.</description>
					<bitRange>[2:2]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>NOT_PENDING</name>
							<description>Not pending. No error interrupts are pending.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>PENDING</name>
							<description>Pending. At least one error interrupt is pending.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Read value is undefined, only zero should be written.</description>
					<bitRange>[31:3]</bitRange>

				</field>
			</fields>
		</register>
		<register>
			<name>SRAMBASE</name>
			<description>SRAM address of the channel configuration table.</description>
			<addressOffset>0x008</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Read value is undefined, only zero should be written.</description>
					<bitRange>[9:0]</bitRange>
				</field>
				<field>
					<name>OFFSET</name>
					<description>Address of the beginning of the DMA descriptor table. The table must begin on a 1 kB boundary. Boundary needed for 18 channel DMA configuration: 512 bytes (bottom 9 bits = 0)</description>
					<bitRange>[31:10]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>ENABLESET0</name>
			<description>Channel Enable read and Set for all DMA channels.</description>
			<addressOffset>0x020</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>ENA0</name>
					<description>Enable for DMA channels 17:0. Bit n enables or disables DMA channel n.  0 = disabled. 1 = enabled.</description>
					<bitRange>[0:0]</bitRange>
				</field>
				<field>
					<name>ENA1</name>
					<description>Enable for DMA channels 17:0. Bit n enables or disables DMA channel n.  0 = disabled. 1 = enabled.</description>
					<bitRange>[1:1]</bitRange>
				</field>
				<field>
					<name>ENA2</name>
					<description>Enable for DMA channels 17:0. Bit n enables or disables DMA channel n.  0 = disabled. 1 = enabled.</description>
					<bitRange>[2:2]</bitRange>
				</field>
				<field>
					<name>ENA3</name>
					<description>Enable for DMA channels 17:0. Bit n enables or disables DMA channel n.  0 = disabled. 1 = enabled.</description>
					<bitRange>[3:3]</bitRange>
				</field>
				<field>
					<name>ENA4</name>
					<description>Enable for DMA channels 17:0. Bit n enables or disables DMA channel n.  0 = disabled. 1 = enabled.</description>
					<bitRange>[4:4]</bitRange>
				</field>
				<field>
					<name>ENA5</name>
					<description>Enable for DMA channels 17:0. Bit n enables or disables DMA channel n.  0 = disabled. 1 = enabled.</description>
					<bitRange>[5:5]</bitRange>
				</field>
				<field>
					<name>ENA6</name>
					<description>Enable for DMA channels 17:0. Bit n enables or disables DMA channel n.  0 = disabled. 1 = enabled.</description>
					<bitRange>[6:6]</bitRange>
				</field>
				<field>
					<name>ENA7</name>
					<description>Enable for DMA channels 17:0. Bit n enables or disables DMA channel n.  0 = disabled. 1 = enabled.</description>
					<bitRange>[7:7]</bitRange>
				</field>
				<field>
					<name>ENA8</name>
					<description>Enable for DMA channels 17:0. Bit n enables or disables DMA channel n.  0 = disabled. 1 = enabled.</description>
					<bitRange>[8:8]</bitRange>
				</field>
				<field>
					<name>ENA9</name>
					<description>Enable for DMA channels 17:0. Bit n enables or disables DMA channel n.  0 = disabled. 1 = enabled.</description>
					<bitRange>[9:9]</bitRange>
				</field>
				<field>
					<name>ENA10</name>
					<description>Enable for DMA channels 17:0. Bit n enables or disables DMA channel n.  0 = disabled. 1 = enabled.</description>
					<bitRange>[10:10]</bitRange>
				</field>
				<field>
					<name>ENA11</name>
					<description>Enable for DMA channels 17:0. Bit n enables or disables DMA channel n.  0 = disabled. 1 = enabled.</description>
					<bitRange>[11:11]</bitRange>
				</field>
				<field>
					<name>ENA12</name>
					<description>Enable for DMA channels 17:0. Bit n enables or disables DMA channel n.  0 = disabled. 1 = enabled.</description>
					<bitRange>[12:12]</bitRange>
				</field>
				<field>
					<name>ENA13</name>
					<description>Enable for DMA channels 17:0. Bit n enables or disables DMA channel n.  0 = disabled. 1 = enabled.</description>
					<bitRange>[13:13]</bitRange>
				</field>
				<field>
					<name>ENA14</name>
					<description>Enable for DMA channels 17:0. Bit n enables or disables DMA channel n.  0 = disabled. 1 = enabled.</description>
					<bitRange>[14:14]</bitRange>
				</field>
				<field>
					<name>ENA15</name>
					<description>Enable for DMA channels 17:0. Bit n enables or disables DMA channel n.  0 = disabled. 1 = enabled.</description>
					<bitRange>[15:15]</bitRange>
				</field>
				<field>
					<name>ENA16</name>
					<description>Enable for DMA channels 17:0. Bit n enables or disables DMA channel n.  0 = disabled. 1 = enabled.</description>
					<bitRange>[16:16]</bitRange>
				</field>
				<field>
					<name>ENA17</name>
					<description>Enable for DMA channels 17:0. Bit n enables or disables DMA channel n.  0 = disabled. 1 = enabled.</description>
					<bitRange>[17:17]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[31:18]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>ENABLECLR0</name>
			<description>Channel Enable Clear for all DMA channels.</description>
			<addressOffset>0x028</addressOffset>
			<access>write-only</access>
			<resetValue>0</resetValue>
			<resetMask>0x00000000</resetMask>
			<fields>
				<field>
					<name>CLR0</name>
					<description>Writing ones to this register clears the corresponding bits in ENABLESET0. Bit n clears the channel enable bit n.</description>
					<bitRange>[0:0]</bitRange>
				</field>
				<field>
					<name>CLR1</name>
					<description>Writing ones to this register clears the corresponding bits in ENABLESET0. Bit n clears the channel enable bit n.</description>
					<bitRange>[1:1]</bitRange>
				</field>
				<field>
					<name>CLR2</name>
					<description>Writing ones to this register clears the corresponding bits in ENABLESET0. Bit n clears the channel enable bit n.</description>
					<bitRange>[2:2]</bitRange>
				</field>
				<field>
					<name>CLR3</name>
					<description>Writing ones to this register clears the corresponding bits in ENABLESET0. Bit n clears the channel enable bit n.</description>
					<bitRange>[3:3]</bitRange>
				</field>
				<field>
					<name>CLR4</name>
					<description>Writing ones to this register clears the corresponding bits in ENABLESET0. Bit n clears the channel enable bit n.</description>
					<bitRange>[4:4]</bitRange>
				</field>
				<field>
					<name>CLR5</name>
					<description>Writing ones to this register clears the corresponding bits in ENABLESET0. Bit n clears the channel enable bit n.</description>
					<bitRange>[5:5]</bitRange>
				</field>
				<field>
					<name>CLR6</name>
					<description>Writing ones to this register clears the corresponding bits in ENABLESET0. Bit n clears the channel enable bit n.</description>
					<bitRange>[6:6]</bitRange>
				</field>
				<field>
					<name>CLR7</name>
					<description>Writing ones to this register clears the corresponding bits in ENABLESET0. Bit n clears the channel enable bit n.</description>
					<bitRange>[7:7]</bitRange>
				</field>
				<field>
					<name>CLR8</name>
					<description>Writing ones to this register clears the corresponding bits in ENABLESET0. Bit n clears the channel enable bit n.</description>
					<bitRange>[8:8]</bitRange>
				</field>
				<field>
					<name>CLR9</name>
					<description>Writing ones to this register clears the corresponding bits in ENABLESET0. Bit n clears the channel enable bit n.</description>
					<bitRange>[9:9]</bitRange>
				</field>
				<field>
					<name>CLR10</name>
					<description>Writing ones to this register clears the corresponding bits in ENABLESET0. Bit n clears the channel enable bit n.</description>
					<bitRange>[10:10]</bitRange>
				</field>
				<field>
					<name>CLR11</name>
					<description>Writing ones to this register clears the corresponding bits in ENABLESET0. Bit n clears the channel enable bit n.</description>
					<bitRange>[11:11]</bitRange>
				</field>
				<field>
					<name>CLR12</name>
					<description>Writing ones to this register clears the corresponding bits in ENABLESET0. Bit n clears the channel enable bit n.</description>
					<bitRange>[12:12]</bitRange>
				</field>
				<field>
					<name>CLR13</name>
					<description>Writing ones to this register clears the corresponding bits in ENABLESET0. Bit n clears the channel enable bit n.</description>
					<bitRange>[13:13]</bitRange>
				</field>
				<field>
					<name>CLR14</name>
					<description>Writing ones to this register clears the corresponding bits in ENABLESET0. Bit n clears the channel enable bit n.</description>
					<bitRange>[14:14]</bitRange>
				</field>
				<field>
					<name>CLR15</name>
					<description>Writing ones to this register clears the corresponding bits in ENABLESET0. Bit n clears the channel enable bit n.</description>
					<bitRange>[15:15]</bitRange>
				</field>
				<field>
					<name>CLR16</name>
					<description>Writing ones to this register clears the corresponding bits in ENABLESET0. Bit n clears the channel enable bit n.</description>
					<bitRange>[16:16]</bitRange>
				</field>
				<field>
					<name>CLR17</name>
					<description>Writing ones to this register clears the corresponding bits in ENABLESET0. Bit n clears the channel enable bit n.</description>
					<bitRange>[17:17]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[31:18]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>ACTIVE0</name>
			<description>Channel Active status for all DMA channels.</description>
			<addressOffset>0x030</addressOffset>
			<access>read-only</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>ACT0</name>
					<description>Active flag for DMA channel n. Bit n corresponds to DMA channel n. 0 = not active. 1 = active.</description>
					<bitRange>[0:0]</bitRange>
				</field>
				<field>
					<name>ACT1</name>
					<description>Active flag for DMA channel n. Bit n corresponds to DMA channel n. 0 = not active. 1 = active.</description>
					<bitRange>[1:1]</bitRange>
				</field>
				<field>
					<name>ACT2</name>
					<description>Active flag for DMA channel n. Bit n corresponds to DMA channel n. 0 = not active. 1 = active.</description>
					<bitRange>[2:2]</bitRange>
				</field>
				<field>
					<name>ACT3</name>
					<description>Active flag for DMA channel n. Bit n corresponds to DMA channel n. 0 = not active. 1 = active.</description>
					<bitRange>[3:3]</bitRange>
				</field>
				<field>
					<name>ACT4</name>
					<description>Active flag for DMA channel n. Bit n corresponds to DMA channel n. 0 = not active. 1 = active.</description>
					<bitRange>[4:4]</bitRange>
				</field>
				<field>
					<name>ACT5</name>
					<description>Active flag for DMA channel n. Bit n corresponds to DMA channel n. 0 = not active. 1 = active.</description>
					<bitRange>[5:5]</bitRange>
				</field>
				<field>
					<name>ACT6</name>
					<description>Active flag for DMA channel n. Bit n corresponds to DMA channel n. 0 = not active. 1 = active.</description>
					<bitRange>[6:6]</bitRange>
				</field>
				<field>
					<name>ACT7</name>
					<description>Active flag for DMA channel n. Bit n corresponds to DMA channel n. 0 = not active. 1 = active.</description>
					<bitRange>[7:7]</bitRange>
				</field>
				<field>
					<name>ACT8</name>
					<description>Active flag for DMA channel n. Bit n corresponds to DMA channel n. 0 = not active. 1 = active.</description>
					<bitRange>[8:8]</bitRange>
				</field>
				<field>
					<name>ACT9</name>
					<description>Active flag for DMA channel n. Bit n corresponds to DMA channel n. 0 = not active. 1 = active.</description>
					<bitRange>[9:9]</bitRange>
				</field>
				<field>
					<name>ACT10</name>
					<description>Active flag for DMA channel n. Bit n corresponds to DMA channel n. 0 = not active. 1 = active.</description>
					<bitRange>[10:10]</bitRange>
				</field>
				<field>
					<name>ACT11</name>
					<description>Active flag for DMA channel n. Bit n corresponds to DMA channel n. 0 = not active. 1 = active.</description>
					<bitRange>[11:11]</bitRange>
				</field>
				<field>
					<name>ACT12</name>
					<description>Active flag for DMA channel n. Bit n corresponds to DMA channel n. 0 = not active. 1 = active.</description>
					<bitRange>[12:12]</bitRange>
				</field>
				<field>
					<name>ACT13</name>
					<description>Active flag for DMA channel n. Bit n corresponds to DMA channel n. 0 = not active. 1 = active.</description>
					<bitRange>[13:13]</bitRange>
				</field>
				<field>
					<name>ACT14</name>
					<description>Active flag for DMA channel n. Bit n corresponds to DMA channel n. 0 = not active. 1 = active.</description>
					<bitRange>[14:14]</bitRange>
				</field>
				<field>
					<name>ACT15</name>
					<description>Active flag for DMA channel n. Bit n corresponds to DMA channel n. 0 = not active. 1 = active.</description>
					<bitRange>[15:15]</bitRange>
				</field>
				<field>
					<name>ACT16</name>
					<description>Active flag for DMA channel n. Bit n corresponds to DMA channel n. 0 = not active. 1 = active.</description>
					<bitRange>[16:16]</bitRange>
				</field>
				<field>
					<name>ACT17</name>
					<description>Active flag for DMA channel n. Bit n corresponds to DMA channel n. 0 = not active. 1 = active.</description>
					<bitRange>[17:17]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[31:18]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>BUSY0</name>
			<description>Channel Busy status for all DMA channels.</description>
			<addressOffset>0x038</addressOffset>
			<access>read-only</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>BSY0</name>
					<description>Busy flag for DMA channel n. Bit n corresponds to DMA channel n. 0 = not busy. 1 = busy.</description>
					<bitRange>[0:0]</bitRange>
				</field>
				<field>
					<name>BSY1</name>
					<description>Busy flag for DMA channel n. Bit n corresponds to DMA channel n. 0 = not busy. 1 = busy.</description>
					<bitRange>[1:1]</bitRange>
				</field>
				<field>
					<name>BSY2</name>
					<description>Busy flag for DMA channel n. Bit n corresponds to DMA channel n. 0 = not busy. 1 = busy.</description>
					<bitRange>[2:2]</bitRange>
				</field>
				<field>
					<name>BSY3</name>
					<description>Busy flag for DMA channel n. Bit n corresponds to DMA channel n. 0 = not busy. 1 = busy.</description>
					<bitRange>[3:3]</bitRange>
				</field>
				<field>
					<name>BSY4</name>
					<description>Busy flag for DMA channel n. Bit n corresponds to DMA channel n. 0 = not busy. 1 = busy.</description>
					<bitRange>[4:4]</bitRange>
				</field>
				<field>
					<name>BSY5</name>
					<description>Busy flag for DMA channel n. Bit n corresponds to DMA channel n. 0 = not busy. 1 = busy.</description>
					<bitRange>[5:5]</bitRange>
				</field>
				<field>
					<name>BSY6</name>
					<description>Busy flag for DMA channel n. Bit n corresponds to DMA channel n. 0 = not busy. 1 = busy.</description>
					<bitRange>[6:6]</bitRange>
				</field>
				<field>
					<name>BSY7</name>
					<description>Busy flag for DMA channel n. Bit n corresponds to DMA channel n. 0 = not busy. 1 = busy.</description>
					<bitRange>[7:7]</bitRange>
				</field>
				<field>
					<name>BSY8</name>
					<description>Busy flag for DMA channel n. Bit n corresponds to DMA channel n. 0 = not busy. 1 = busy.</description>
					<bitRange>[8:8]</bitRange>
				</field>
				<field>
					<name>BSY9</name>
					<description>Busy flag for DMA channel n. Bit n corresponds to DMA channel n. 0 = not busy. 1 = busy.</description>
					<bitRange>[9:9]</bitRange>
				</field>
				<field>
					<name>BSY10</name>
					<description>Busy flag for DMA channel n. Bit n corresponds to DMA channel n. 0 = not busy. 1 = busy.</description>
					<bitRange>[10:10]</bitRange>
				</field>
				<field>
					<name>BSY11</name>
					<description>Busy flag for DMA channel n. Bit n corresponds to DMA channel n. 0 = not busy. 1 = busy.</description>
					<bitRange>[11:11]</bitRange>
				</field>
				<field>
					<name>BSY12</name>
					<description>Busy flag for DMA channel n. Bit n corresponds to DMA channel n. 0 = not busy. 1 = busy.</description>
					<bitRange>[12:12]</bitRange>
				</field>
				<field>
					<name>BSY13</name>
					<description>Busy flag for DMA channel n. Bit n corresponds to DMA channel n. 0 = not busy. 1 = busy.</description>
					<bitRange>[13:13]</bitRange>
				</field>
				<field>
					<name>BSY14</name>
					<description>Busy flag for DMA channel n. Bit n corresponds to DMA channel n. 0 = not busy. 1 = busy.</description>
					<bitRange>[14:14]</bitRange>
				</field>
				<field>
					<name>BSY15</name>
					<description>Busy flag for DMA channel n. Bit n corresponds to DMA channel n. 0 = not busy. 1 = busy.</description>
					<bitRange>[15:15]</bitRange>
				</field>
				<field>
					<name>BSY16</name>
					<description>Busy flag for DMA channel n. Bit n corresponds to DMA channel n. 0 = not busy. 1 = busy.</description>
					<bitRange>[16:16]</bitRange>
				</field>
				<field>
					<name>BSY17</name>
					<description>Busy flag for DMA channel n. Bit n corresponds to DMA channel n. 0 = not busy. 1 = busy.</description>
					<bitRange>[17:17]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[31:18]</bitRange>
				</field>
			</fields>
		</register>
