Manish-Subedi/embedded_Iot_project/ventilation_system/Debug/LPC15xx_peripheral.xml
				</field>
				<field>
					<name>LPM_REWP</name>
					<description>LPM Remote Wake-up Enabled by USB host.  HW sets this bit to one when the bRemoteWake bit in the LPM extended token is set to 1. HW will reset this bit to 0 when it receives the host initiated LPM resume, when a remote wake-up is sent by the device or when a USB bus reset is received. Software can use this bit to check if the remote wake-up feature is enabled by the host for the LPM transaction.</description>
					<bitRange>[20:20]</bitRange>

				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[23:21]</bitRange>

				</field>
				<field>
					<name>DCON_C</name>
					<description>Device status - connect change.  The Connect Change bit is set when the device's pull-up resistor is disconnected because VBus disappeared. The bit is reset by writing a one to it.</description>
					<bitRange>[24:24]</bitRange>

				</field>
				<field>
					<name>DSUS_C</name>
					<description>Device status - suspend change.  The suspend change bit is set to 1 when the suspend bit toggles. The suspend bit can toggle because: - The device goes in the suspended state  - The device is disconnected - The device receives resume signaling on its upstream port.  The bit is reset by writing a one to it.</description>
					<bitRange>[25:25]</bitRange>

				</field>
				<field>
					<name>DRES_C</name>
					<description>Device status - reset change.  This bit is set when the device received a bus reset. On a bus reset the device will automatically go to the default state (unconfigured and responding to address 0). The bit is reset by writing a one to it.</description>
					<bitRange>[26:26]</bitRange>

				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[27:27]</bitRange>

				</field>
				<field>
					<name>VBUSDEBOUNCED</name>
					<description>This bit indicates if Vbus is detected or not. The bit raises immediately when Vbus becomes high. It drops to zero if Vbus is low for at least 3 ms. If this bit is high and the DCon bit is set, the HW will enable the pull-up resistor to signal a connect.</description>
					<bitRange>[28:28]</bitRange>

				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[31:29]</bitRange>

				</field>
			</fields>
		</register>
		<register>
			<name>INFO</name>
			<description>USB Info register</description>
			<addressOffset>0x004</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>FRAME_NR</name>
					<description>Frame number. This contains the frame number of the last successfully received SOF. In case no SOF was received by the device at the beginning of a frame, the frame number returned is that of the last successfully received SOF. In case the SOF frame number contained a CRC error, the frame number returned will be the corrupted frame number as received by the device.</description>
					<bitRange>[10:0]</bitRange>

				</field>
				<field>
					<name>ERR_CODE</name>
					<description>The error code which last occurred:</description>
					<bitRange>[14:11]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>NO_ERROR</name>
							<description>No error</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>PID_ENCODING_ERROR</name>
							<description>PID encoding error</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>PID_UNKNOWN</name>
							<description>PID unknown</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>PACKET_UNEXPECTED</name>
							<description>Packet unexpected</description>
							<value>0x3</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>TOKEN_CRC_ERROR</name>
							<description>Token CRC error</description>
							<value>0x4</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>DATA_CRC_ERROR</name>
							<description>Data CRC error</description>
							<value>0x5</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>TIME_OUT</name>
							<description>Time out</description>
							<value>0x6</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>BABBLE</name>
							<description>Babble</description>
							<value>0x7</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>TRUNCATED_EOP</name>
							<description>Truncated EOP</description>
							<value>0x8</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SENT_RECEIVED_NAK</name>
							<description>Sent/Received NAK</description>
							<value>0x9</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SENT_STALL</name>
							<description>Sent Stall</description>
							<value>0xA</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>OVERRUN</name>
							<description>Overrun</description>
							<value>0xB</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SENT_EMPTY_PACKET</name>
							<description>Sent empty packet</description>
							<value>0xC</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>BITSTUFF_ERROR</name>
							<description>Bitstuff error</description>
							<value>0xD</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SYNC_ERROR</name>
							<description>Sync error</description>
							<value>0xE</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>WRONG_DATA_TOGGLE</name>
							<description>Wrong data toggle</description>
							<value>0xF</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[15:15]</bitRange>

				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[31:16]</bitRange>

