Manish-Subedi/embedded_Iot_project/ventilation_system/Debug/LPC15xx_peripheral.xml
				</field>
			</fields>
		</register>
		<register>
			<dim>10</dim>
			<dimIncrement>0x8</dimIncrement>
			<dimIndex>0-9</dimIndex>
			<name>OUT%s_SET</name>
			<description>SCT output 0 set register</description>
			<addressOffset>0x500</addressOffset>
			<access>read-write</access>
			<resetValue>0x00000000</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>SET</name>
					<description>A 1 in bit m selects event m to set output n (or clear it if SETCLRn = 0x1 or 0x2) event 0 = bit 0, event 1 = bit 1,..., event 15 = bit 15.</description>
					<bitRange>[15:0]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[31:16]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<dim>10</dim>
			<dimIncrement>0x8</dimIncrement>
			<dimIndex>0-9</dimIndex>
			<name>OUT%s_CLR</name>
			<description>SCT output 0 clear register</description>
			<addressOffset>0x504</addressOffset>
			<access>read-write</access>
			<resetValue>0x00000000</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>CLR</name>
					<description>A 1 in bit m selects event m to clear output n (or set it if SETCLRn = 0x1 or 0x2) event 0 = bit 0, event 1 = bit 1,..., event 15 = bit 15.</description>
					<bitRange>[15:0]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[31:16]</bitRange>
				</field>
			</fields>
		</register>
	</registers>
		</peripheral>

		<peripheral derivedFrom="SCT0">
			<name>SCT1</name>
			<description>SCT1</description>
			<baseAddress>0x1C01C000</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>0xFFF</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>SCT1</name>
				<value>17</value>
			</interrupt>

		</peripheral>
<peripheral>
	<name>SCT2</name>
	<description>Small State Configurable Timers 2/3 (SCT2/3) </description>
	<groupName>SCT2</groupName>
	<baseAddress>0x1C020000</baseAddress>
	<addressBlock>
	<offset>0x0</offset>
	<size>0xFFF</size>
	<usage>registers</usage>
	</addressBlock>
	<interrupt>
	<name>SCT2</name>
	<value>18</value>
	</interrupt>
	<registers>
		<register>
			<name>CONFIG</name>
			<description>SCT configuration register</description>
			<addressOffset>0x000</addressOffset>
			<access>read-write</access>
			<resetValue>0x00007E00</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>UNIFY</name>
					<description>SCT operation</description>
					<bitRange>[0:0]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>THE_SCT_OPERATES_AS</name>
							<description>The SCT operates as two 16-bit counters named L and H.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>THE_SCT_OPERATES_AS</name>
							<description>The SCT operates as a unified 32-bit counter.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>CLKMODE</name>
					<description>SCT clock mode</description>
					<bitRange>[2:1]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>THE_BUS_CLOCK_CLOCKS</name>
							<description>The bus clock clocks the SCT and prescalers.</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>THE_SCT_CLOCK_IS_THE</name>
							<description>The SCT clock is the bus clock, but the prescalers are  enabled to count only when sampling of the input selected by  the CKSEL field finds the selected edge. The minimum pulse  width on the clock input is 1 bus clock period. This mode is the high-performance  sampled-clock mode.</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>THE_INPUT_SELECTED_B</name>
							<description>The input selected by  CKSEL clocks the SCT and prescalers. The input is synchronized to the bus clock and possibly inverted.  The minimum pulse width on the clock input is 1 bus clock  period. This mode is the low-power sampled-clock mode.</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>RESERVED</name>
							<description>Reserved.This is not reserved on the LPC15xx. Need to add back in from spec.</description>
							<value>0x3</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>CKSEL</name>
					<description>SCT clock select</description>
					<bitRange>[6:3]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>RISING_EDGES_ON_INPU</name>
							<description>Rising edges on input 0.</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>FALLING_EDGES_ON_INP</name>
							<description>Falling edges on input 0.</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>RISING_EDGES_ON_INPU</name>
							<description>Rising edges on input 1.</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>FALLING_EDGES_ON_INP</name>
							<description>Falling edges on input 1.</description>
							<value>0x3</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>RISING_EDGES_ON_INPU</name>
							<description>Rising edges on input 2.</description>
							<value>0x4</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>FALLING_EDGES_ON_INP</name>
							<description>Falling edges on input 2.</description>
							<value>0x5</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>RISING_EDGES_ON_INPU</name>
							<description>Rising edges on input 3.</description>
							<value>0x6</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>FALLING_EDGES_ON_INP</name>
							<description>Falling edges on input 3.</description>
							<value>0x7</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>NORELAOD_L</name>
					<description>A 1 in this bit prevents the lower match registers from being  reloaded from their respective reload registers. Software can  write to set or clear this bit at any time. This bit applies to both the  higher and lower registers when the UNIFY bit is set.</description>
					<bitRange>[7:7]</bitRange>

