Manish-Subedi/embedded_Iot_project/ventilation_system/Debug/LPC15xx_peripheral.xml
				</field>
				<field>
					<name>CALMODE</name>
					<description>Writing a 1 to this bit initiates a self-calibration cycle. This bit will be automatically cleared by hardware after the calibration cycle is complete. Other bits of this register may be written to concurrently with setting this bit, however once this bit has been set no further writes to this register are permitted until the full calibration cycle has ended.</description>
					<bitRange>[30:30]</bitRange>

				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[31:31]</bitRange>

				</field>
			</fields>
		</register>
		<register>
			<name>INSEL</name>
			<description>A/D Input Select Register: Selects between external pin and internal source for various channels</description>
			<addressOffset>0x004</addressOffset>
			<access>read-write</access>
			<resetValue>0x0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>AD0SEL</name>
					<description>This field selects the input source for channel 0. All other values are reserved.</description>
					<bitRange>[3:0]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>ADCN_0_PIN</name>
							<description>ADCn_0 pin. Voltage on ADC channel 0 input.</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>CORE_VOLTAGE_REGULAT</name>
							<description>Core voltage regulator output (1.2V to 1.8V). If the WRAPEN field is 0x2, the core voltage regulator output is also is output on the ADC0/1_0 pin.</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>INTERNAL_VOLTAGE_REF</name>
							<description>Internal voltage reference. If the WRAPEN field is 0x2, the internal voltage reference is also is output on the ADCn_0 pin.</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>TEMPERATURE_SENSOR</name>
							<description>Temperature Sensor. If the WRAPEN field is 0x2, the temperature sensor voltage is also is output on the ADCn_0 pin.</description>
							<value>0x3</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>VDDADIV2</name>
							<description>VDDA/2.</description>
							<value>0x4</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>NO_CONNECTION_OR_LOA</name>
							<description>No connection or load</description>
							<value>0xF</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[29:4]</bitRange>

				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[31:30]</bitRange>

				</field>
			</fields>
		</register>
		<register>
			<name>SEQA_CTRL</name>
			<description>A/D Conversion Sequence-A control Register: Controls triggering and channel selection for conversion sequence-A. Also specifies interrupt mode for sequence-A.</description>
			<addressOffset>0x008</addressOffset>
			<access>read-write</access>
			<resetValue>0x0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>CHANNELS</name>
					<description>Selects which one or more of the twelve channels will be sampled and converted when this sequence is launched. A 1 in any bit of this field will cause the corresponding channel to be included in the conversion sequence, where bit 0 corresponds to channel 0, bit 1 to channel 1 and so forth.  When this conversion sequence is triggered, either by a hardware trigger or via software command, A/D conversions will be performed on each enabled channel, in sequence, beginning with the lowest-ordered channel.  This field can ONLY be changed while the SEQA_ENA bit (bit 31) is LOW. It is allowed to change this field and set bit 31 in the same write.</description>
					<bitRange>[11:0]</bitRange>

				</field>
				<field>
					<name>TRIGGER</name>
					<description>Selects which of the available hardware trigger sources will cause this conversion sequence to be initiated. Program the trigger input number in this field.</description>
					<bitRange>[15:12]</bitRange>

				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
					<bitRange>[17:16]</bitRange>

				</field>
				<field>
					<name>TRIGPOL</name>
					<description>Select the polarity of the selected input trigger for this conversion sequence.</description>
					<bitRange>[18:18]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>NEGATIVE_EDGE</name>
							<description>Negative edge. A negative edge launches the conversion sequence on the selected trigger input.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>POSITIVE_EDGE</name>
							<description>Positive edge. A positive edge launches the conversion sequence on the selected trigger input.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>SYNCBYPASS</name>
					<description>Setting this bit allows the hardware trigger input to bypass  synchronization flip-flops stages and therefore shorten the time between the trigger input signal and the start of a conversion. There are slightly different criteria for whether or not this bit can be set depending on the clock operating mode: Synchronous mode: Synchronization may be bypassed (this bit may be set) if the selected trigger source is already synchronous with the main system clock (eg. coming from an on-chip, system-clock-based timer). Whether this bit is set or not, a trigger pulse must be maintained for at least one system clock period. Asynchronous mode: Synchronization may be bypassed (this bit may be set) if it is certain that the duration of a trigger input pulse will be at least one cycle of the ADC clock (regardless of whether the trigger comes from and on-chip or off-chip source). If this bit is NOT set, the trigger pulse must at least be maintained for one system clock period.</description>
					<bitRange>[19:19]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>ENABLE_SYNCHRONIZATI</name>
							<description>Enable synchronization. The hardware trigger bypass is not enabled.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>BYPASS_SYNCHRONIZATI</name>
							<description>Bypass synchronization. The hardware trigger bypass is enabled.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
					<bitRange>[25:20]</bitRange>

