Manish-Subedi/embedded_Iot_project/ventilation_system/Debug/LPC15xx_peripheral.xml
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[31:31]</bitRange>

				</field>
			</fields>
		</register>
		<register>
			<dim>4</dim>
			<dimIncrement>0x8</dimIncrement>
			<dimIndex>0-3</dimIndex>
			<name>CMPFILTR%s</name>
			<description>Comparator 0 pin filter set-up</description>
			<addressOffset>0x008</addressOffset>
			<access>read-write</access>
			<resetValue>0x0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>S_MODE</name>
					<description>Digital filter sample mode.</description>
					<bitRange>[1:0]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>BYPASS_INPUT_FILTER</name>
							<description>Bypass input filter.</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>1_CLOCK_CYCLE</name>
							<description>1 clock cycle. Input pulses shorter than one filter clock are rejected.</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>2_CLOCK_CYCLES</name>
							<description>2 clock cycles. Input pulses shorter than two filter clocks are rejected.</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>3_CLOCK_CYCLES</name>
							<description>3 clock cycles. Input pulses shorter than three filter clocks are rejected.</description>
							<value>0x3</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>CLKDIV</name>
					<description>Select clock divider for comparator clock CMP_PCLK.</description>
					<bitRange>[4:2]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>CMP_PCLK</name>
							<description>CMP_PCLK.</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>CMP_PCLKDIV2</name>
							<description>CMP_PCLK/2.</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>CMP_PCLKDIV4</name>
							<description>CMP_PCLK/4.</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>CMP_PCLKDIV8</name>
							<description>CMP_PCLK/8.</description>
							<value>0x3</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>CMP_PCLKDIV16</name>
							<description>CMP_PCLK/16.</description>
							<value>0x4</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>CMP_PCLKDIV32</name>
							<description>CMP_PCLK/32.</description>
							<value>0x5</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>CMP_PCLKDIV64</name>
							<description>CMP_PCLK/64.</description>
							<value>0x6</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[31:5]</bitRange>

				</field>
			</fields>
		</register>
	</registers>
</peripheral>
		<peripheral>
			<name>INMUX</name>
			<description>Input multiplexing (INMUX) </description>
			<groupName>INMUX</groupName>
			<baseAddress>0x40014000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0xFFF</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<dim>7</dim>
					<dimIncrement>0x4</dimIncrement>
					<dimIndex>0-6</dimIndex>
					<name>SCT0_INMUX[%s]</name>
					<displayName>SCT0_INMUX[%s]</displayName>
					<description>Pinmux register for SCT0 input 0</description>
					<addressOffset>0x000</addressOffset>
					<access>read-write</access>
					<resetValue>0x1F</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>INP_N</name>
							<description>Input number (decimal value) to SCT0 inputs 0 to 6.  0 = 	PIO0_2 (external pin) 1	 = PIO0_3 (external pin) 2	 = PIO0_17 (external pin) 3	 = PIO0_30 (external pin) 4	 = PIO1_6 (external pin) 5	 = PIO1_7 (external pin) 6	 = PIO1_12 (external pin) 7 = 	PIO1_13 (external pin) 8	 = SCT1_OUT4 (large SCT1 output 4) 9 = 	SCT2_OUT4 (companion small SCT2 output 4) 10 = 	SCT2_OUT5 (companion small SCT2 output 5) 11	 = ADC0_THCMP_IRQ () 12	 = ADC1_THCMP_IRQ () 13	 = COMP0_OUT (One output from each analog comparator) 14	 = COMP1_OUT 15	 = COMP2_OUT 16	 = COMP3_OUT 17	 = SCTIPU_ABORT 18	 = SCTIPU_SAMPLE0 19	 = SCTIPU_SAMPLE1 20 = 	SCTIPU_SAMPLE2 21	 = SCTIPU_SAMPLE3 22 = 	DEBUG_HALTED (from ARM Cortex CoreSight Debugger)</description>
							<bitRange>[4:0]</bitRange>
							<enumeratedValues>
								<enumeratedValue>
									<name>PIO0_2</name>
									<description>PIO0_2 (external pin)</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PIO0_3</name>
									<description>PIO0_3 (external pin)</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PIO0_17</name>
									<description>PIO0_17 (external pin)</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PIO0_30</name>
									<description>PIO0_30 (external pin)</description>
									<value>0x3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PIO1_6</name>
									<description>PIO1_6 (external pin)</description>
									<value>0x4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PIO1_7</name>
									<description>PIO1_7 (external pin)</description>
									<value>0x5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PIO1_12</name>
									<description>PIO1_12 (external pin)</description>
									<value>0x6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PIO1_13</name>
									<description>PIO1_13 (external pin)</description>
									<value>0x7</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SCT1_OUT4</name>
									<description>SCT1_OUT4 (large SCT1 output 4)</description>
									<value>0x8</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SCT2_OUT4</name>
									<description>SCT2_OUT4 (small SCT2 output 4)</description>
									<value>0x9</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SCT2_OUT5</name>
									<description>SCT2_OUT5 (small SCT2 output 5)</description>
									<value>0xA</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADC0_THCMP_IRQ</name>
									<description>ADC0_THCMP_IRQ (ADC0 threshold compare interrupt)</description>
									<value>0xB</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADC1_THCMP_IRQ</name>
									<description>ADC1_THCMP_IRQ (ADC1 threshold compare interrupt)</description>
									<value>0xC</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACMP0_OUT</name>
									<description>ACMP0_OUT (One output from each analog comparator)</description>
									<value>0xD</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACMP1_OUT</name>
									<description>ACMP1_OUT (One output from each analog comparator)</description>
									<value>0xE</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACMP2_OUT</name>
									<description>ACMP2_OUT (One output from each analog comparator)</description>
									<value>0xF</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACMP3_OUT</name>
									<description>ACMP3_OUT (One output from each analog comparator)</description>
									<value>0x10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SCTIPU_ABORT</name>
									<description>SCTIPU_ABORT</description>
									<value>0x11</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SCTIPU_SAMPLE0</name>
									<description>SCTIPU_SAMPLE0</description>
									<value>0x12</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SCTIPU_SAMPLE1</name>
									<description>SCTIPU_SAMPLE1</description>
									<value>0x13</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SCTIPU_SAMPLE2</name>
									<description>SCTIPU_SAMPLE2</description>
									<value>0x14</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SCTIPU_SAMPLE3</name>
									<description>SCTIPU_SAMPLE3</description>
									<value>0x15</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DEBUG_HALTED</name>
									<description>ARM DEBUG HALTED</description>
									<value>0x16</value>
								</enumeratedValue>
							</enumeratedValues>

