Manish-Subedi/embedded_Iot_project/ventilation_system/Debug/LPC15xx_peripheral.xml
			</field>
			<field>
				<name>EVENTTIMEOUT</name>
				<description>Event Time-out Interrupt flag. Indicates when the time between events has been longer than the time specified by the TIMEOUT register. Events include Start, Stop, and clock edges. The flag is cleared by writing a 1 to this bit. No time-out is created when the I2C-bus is idle.</description>
				<bitRange>[24:24]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>NO_TIME_OUT</name>
						<description>No time-out. I2C bus events have not caused a time-out.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>EVENT_TIME_OUT</name>
						<description>Event time-out. The time between I2C bus events has been longer than the time specified by the I2C TIMEOUT register.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>SCLTIMEOUT</name>
				<description>SCL Time-out Interrupt flag. Indicates when SCL has remained low longer than the time specific by the TIMEOUT register. The flag is cleared by writing a 1 to this bit.</description>
				<bitRange>[25:25]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>NO_TIME_OUT</name>
						<description>No time-out. SCL low time has not caused a time-out.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>TIME_OUT</name>
						<description>Time-out. SCL low time has caused a time-out.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved. Read value is undefined, only zero should be written.</description>
				<bitRange>[31:26]</bitRange>

			</field>
		</fields>
	</register>
	<register>
		<name>INTENSET</name>
		<description>Interrupt Enable Set and read register.</description>
		<addressOffset>0x08</addressOffset>
		<access>read-write</access>
		<resetValue>0</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>MSTPENDINGEN</name>
				<description>Master Pending interrupt Enable.</description>
				<bitRange>[0:0]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>THE_MSTPENDING_INTER</name>
						<description>The MstPending interrupt is disabled.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>THE_MSTPENDING_INTER</name>
						<description>The MstPending interrupt is enabled.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved. Read value is undefined, only zero should be written.</description>
				<bitRange>[3:1]</bitRange>

			</field>
			<field>
				<name>MSTARBLOSSEN</name>
				<description>Master Arbitration Loss interrupt Enable.</description>
				<bitRange>[4:4]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>THE_MSTARBLOSS_INTER</name>
						<description>The MstArbLoss interrupt is disabled.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>THE_MSTARBLOSS_INTER</name>
						<description>The MstArbLoss interrupt is enabled.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved. Read value is undefined, only zero should be written.</description>
				<bitRange>[5:5]</bitRange>

			</field>
			<field>
				<name>MSTSTSTPERREN</name>
				<description>Master Start/Stop Error interrupt Enable.</description>
				<bitRange>[6:6]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>THE_MSTSTSTPERR_INTE</name>
						<description>The MstStStpErr interrupt is disabled.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>THE_MSTSTSTPERR_INTE</name>
						<description>The MstStStpErr interrupt is enabled.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved. Read value is undefined, only zero should be written.</description>
				<bitRange>[7:7]</bitRange>

			</field>
			<field>
				<name>SLVPENDINGEN</name>
				<description>Slave Pending interrupt Enable.</description>
				<bitRange>[8:8]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>THE_SLVPENDING_INTER</name>
						<description>The SlvPending interrupt is disabled.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>THE_SLVPENDING_INTER</name>
						<description>The SlvPending interrupt is enabled.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved. Read value is undefined, only zero should be written.</description>
				<bitRange>[10:9]</bitRange>

			</field>
			<field>
				<name>SLVNOTSTREN</name>
				<description>Slave Not Stretching interrupt Enable.</description>
				<bitRange>[11:11]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>THE_SLVNOTSTR_INTERR</name>
						<description>The SlvNotStr interrupt is disabled.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>THE_SLVNOTSTR_INTERR</name>
						<description>The SlvNotStr interrupt is enabled.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved. Read value is undefined, only zero should be written.</description>
				<bitRange>[14:12]</bitRange>

			</field>
			<field>
				<name>SLVDESELEN</name>
				<description>Slave Deselect interrupt Enable.</description>
				<bitRange>[15:15]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>THE_SLVDESEL_INTERRU</name>
						<description>The SlvDeSel interrupt is disabled.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>THE_SLVDESEL_INTERRU</name>
						<description>The SlvDeSel interrupt is enabled.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>MONRDYEN</name>
				<description>Monitor data Ready interrupt Enable.</description>
				<bitRange>[16:16]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>THE_MONRDY_INTERRUPT</name>
						<description>The MonRdy interrupt is disabled.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>THE_MONRDY_INTERRUPT</name>
						<description>The MonRdy interrupt is enabled.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>MONOVEN</name>
				<description>Monitor Overrun interrupt Enable.</description>
				<bitRange>[17:17]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>THE_MONOV_INTERRUPT</name>
						<description>The MonOv interrupt is disabled.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>THE_MONOV_INTERRUPT</name>
						<description>The MonOv interrupt is enabled.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved. Read value is undefined, only zero should be written.</description>
				<bitRange>[18:18]</bitRange>

