Manish-Subedi/embedded_Iot_project/ventilation_system/Debug/LPC15xx_peripheral.xml
				</field>
				<field>
					<name>ADC0_RST</name>
					<description>ADC0 reset control</description>
					<bitRange>[27:27]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>CLEAR_ADC0_RESET_</name>
							<description>Clear ADC0 reset.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ASSERT_ADC0_RESET_</name>
							<description>Assert ADC0 reset.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>ADC1_RST</name>
					<description>ADC1 reset control</description>
					<bitRange>[28:28]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>CLEAR_ADC1_RESET_</name>
							<description>Clear ADC1 reset.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ASSERT_ADC1_RESET_</name>
							<description>Assert ADC1 reset.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>DAC_RST</name>
					<description>DAC reset control</description>
					<bitRange>[29:29]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>CLEAR_DAC_RESET_</name>
							<description>Clear DAC reset.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ASSERT_DAC_RESET_</name>
							<description>Assert DAC reset.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>ACMP_RST</name>
					<description>Analog Comparator (ACMP) reset control for all four 4 comparators in the analog comparator block.</description>
					<bitRange>[30:30]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>CLEAR_CMP_RESET_</name>
							<description>Clear CMP reset.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ASSERT_CMP_RESET_</name>
							<description>Assert CMP reset.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[31:31]</bitRange>

				</field>
			</fields>
		</register>
		<register>
			<name>PRESETCTRL1</name>
			<description>Peripheral reset control 1</description>
			<addressOffset>0x048</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>MRT_RST</name>
					<description>Multi-rate timer (MRT) reset control</description>
					<bitRange>[0:0]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>CLEAR_MRT_RESET_</name>
							<description>Clear MRT reset.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ASSERT_MRT_RESET_</name>
							<description>Assert MRT reset.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RIT_RST</name>
					<description>Repetitive interrupt timer (RIT) reset control</description>
					<bitRange>[1:1]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>CLEAR_RIT_RESET_</name>
							<description>Clear RIT reset.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ASSERT_RIT_RESET_</name>
							<description>Assert RIT reset.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>SCT0_RST</name>
					<description>State configurable timer 0 (SCT0) reset control</description>
					<bitRange>[2:2]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>CLEAR_SCT0_RESET_</name>
							<description>Clear SCT0 reset.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ASSERT_SCT0_RESET_</name>
							<description>Assert SCT0 reset.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>SCT1_RST</name>
					<description>State configurable timer 1 (SCT1) reset control</description>
					<bitRange>[3:3]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>CLEAR_SCT1_RESET_</name>
							<description>Clear SCT1 reset.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ASSERT_SCT1_RESET_</name>
							<description>Assert SCT1 reset.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>SCT2_RST</name>
					<description>State configurable timer 2 (SCT2) reset control</description>
					<bitRange>[4:4]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>CLEAR_SCT2_RESET_</name>
							<description>Clear SCT2 reset.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ASSERT_SCT2_RESET_</name>
							<description>Assert SCT2 reset.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>SCT3_RST</name>
					<description>State configurable timer 3 (SCT3) reset control</description>
					<bitRange>[5:5]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>CLEAR_SCT3_RESET_</name>
							<description>Clear SCT3 reset.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ASSERT_SCT3_RESET_</name>
							<description>Assert SCT3 reset.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>SCTIPU_RST</name>
					<description>State configurable timer IPU (SCTIPU) reset control</description>
					<bitRange>[6:6]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>CLEAR_SCTIPU_RESET_</name>
							<description>Clear SCTIPU reset.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ASSERT_SCTIPU_RESET_</name>
							<description>Assert SCTIPU reset.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>CCAN_RST</name>
					<description>CCAN reset control</description>
					<bitRange>[7:7]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>CLEAR_CCAN_RESET_</name>
							<description>Clear CCAN reset.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ASSERT_CCAN_RESET_</name>
							<description>Assert CCAN reset.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[8:8]</bitRange>

