Manish-Subedi/embedded_Iot_project/ventilation_system/Debug/LPC15xx_peripheral.xml
				</field>
			</fields>
		</register>
		<register>
			<name>MAINCLKSELB</name>
			<description>Main clock source select B</description>
			<addressOffset>0x084</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>SEL</name>
					<description>Clock source for main clock source selector B. Selects the clock source for the main clock.</description>
					<bitRange>[1:0]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>MAINCLKSELA_CLOCK_S</name>
							<description>MAINCLKSELA. Clock source selected in MAINCLKSELA register.</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SYSTEM_PLL_INPUT_</name>
							<description>System PLL input.</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SYSTEM_PLL_OUTPUT_</name>
							<description>System PLL output.</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>RTC_OSCILLATOR_32_KH</name>
							<description>RTC oscillator 32 kHz output.</description>
							<value>0x3</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[31:2]</bitRange>

				</field>
			</fields>
		</register>
		<register>
			<name>USBCLKSEL</name>
			<description>USB clock source select</description>
			<addressOffset>0x088</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0x00000000</resetMask>
			<fields>
				<field>
					<name>SEL</name>
					<description>USB clock source.</description>
					<bitRange>[1:0]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>IRC_OSCILLATOR</name>
							<description>IRC Oscillator</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SYSTEM_OSCILLATOR</name>
							<description>System oscillator</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>USB_PLL_OUT</name>
							<description>USB PLL out</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>MAIN_CLOCK</name>
							<description>Main clock</description>
							<value>0x3</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[31:2]</bitRange>

				</field>
			</fields>
		</register>
		<register>
			<name>ADCASYNCCLKSEL</name>
			<description>ADC asynchronous clock source select</description>
			<addressOffset>0x08C</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0x00000000</resetMask>
			<fields>
				<field>
					<name>SEL</name>
					<description>USB clock source.</description>
					<bitRange>[1:0]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>IRC_OSCILLATOR</name>
							<description>IRC Oscillator</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SYSTEM_PLL_OUTPUT</name>
							<description>System PLL output</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>USB_PLL_OUTPUT</name>
							<description>USB PLL output</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SCT_PLL_OUTPUT</name>
							<description>SCT PLL output</description>
							<value>0x3</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[31:2]</bitRange>

				</field>
			</fields>
		</register>
		<register>
			<name>CLKOUTSELA</name>
			<description>CLKOUT clock source select A</description>
			<addressOffset>0x094</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>SEL</name>
					<description>CLKOUT clock source</description>
					<bitRange>[1:0]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>IRC_OSCILLATOR</name>
							<description>IRC oscillator</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>CRYSTAL_OSCILLATOR_</name>
							<description>Crystal oscillator (SYSOSC)</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>WATCHDOG_OSCILLATOR</name>
							<description>Watchdog oscillator</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>MAIN_CLOCK</name>
							<description>Main clock</description>
							<value>0x3</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[31:2]</bitRange>

				</field>
			</fields>
		</register>
		<register>
			<name>CLKOUTSELB</name>
			<description>CLKOUT clock source select B</description>
			<addressOffset>0x098</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>SEL</name>
					<description>CLKOUT clock source</description>
					<bitRange>[1:0]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>CLKOUTSELA_CLOCK_SO</name>
							<description>CLKOUTSELA. Clock source selected in the CLKOUTSELA register.</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>USB_PLL_OUTPUT_</name>
							<description>USB PLL output .</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SCT_PLL_OUTPUT_</name>
							<description>SCT PLL output .</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>RTC_32_KHZ_OUTPUT_</name>
							<description>RTC 32 kHz output.</description>
							<value>0x3</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[31:2]</bitRange>

