Manish-Subedi/embedded_Iot_project/ventilation_system/Debug/LPC15xx_peripheral.xml
	<!-- AWB added 2015/04/30 -->
		<register>
			<name>FREQMECTRL</name>
			<description>Frequency measure register</description>
			<addressOffset>0x120</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>CAPVAL</name>
					<description>Stores the capture result which is used to calculate the frequency of the target clock. This field is read-only.</description>
					<bitRange>[13:0]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[30:14]</bitRange>
				</field>
				<field>
					<name>PROG</name>
					<description>Set this bit to one to initiate a frequency measurement cycle. Hardware clears this bit when the measurement cycle has completed and there is valid capture data in the CAPVAL field (bits 13:0).</description>
					<bitRange>[31:31]</bitRange>
				</field>
			</fields>
		</register>

		<register>
			<name>FLASHCFG</name>
			<description>Flash waitstates configuration register</description>
			<addressOffset>0x124</addressOffset>
			<access>read-write</access>
			<resetValue>0x201A</resetValue>
			<resetMask>0x00003FFF</resetMask>
			<fields>
				<field>
					<name>RESERVED</name>
					<description>Reserved. User software must not change the value of these bits. Bits 11:0 must be written back exactly as read.</description>
					<bitRange>[11:0]</bitRange>
				</field>
				<field>
					<name>FLASHTIM</name>
					<description>Flash memory access time. FLASHTIM +1 is equal to the number of system clocks used for flash access.</description>
					<bitRange>[13:12]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>1_SYSTEM_CLOCK</name>
							<description>1 system clock flash access time (for system clock frequencies of up to 25 MHz).</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>2_SYSTEM_CLOCKS</name>
							<description>2 system clocks flash access time (for system clock frequencies of up to 55 MHz).</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>3_SYSTEM_CLOCKS</name>
							<description>3 system clocks flash access time (for system clock frequencies of up to 72 MHz).</description>
							<value>0x2</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. User software must not change the value of these bits. Bits 31:14 must be written back exactly as read.</description>
					<bitRange>[31:14]</bitRange>
				</field>
			</fields>
		</register>
	<!-- end AWB added 2015/04/30 -->

		<register>
			<name>FRGCTRL</name>
			<description>USART fractional baud rate generator control</description>
			<addressOffset>0x128</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0x00000000</resetMask>
			<fields>
				<field>
					<name>DIV</name>
					<description>Denominator of the fractional divider. DIV is equal to the programmed value +1. Always set to 0xFF to use with the fractional baud rate generator.</description>
					<bitRange>[7:0]</bitRange>
				</field>
				<field>
					<name>MULT</name>
					<description>Numerator of the fractional divider. MULT is equal to the programmed value.</description>
					<bitRange>[15:8]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[31:16]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>USBCLKCTRL</name>
			<description>USB clock control</description>
			<addressOffset>0x12C</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0x00000000</resetMask>
			<fields>
				<field>
					<name>AP_CLK</name>
					<description>USB need_clock signal control</description>
					<bitRange>[0:0]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>UNDER_HARDWARE_CONTR</name>
							<description>Under hardware control.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>FORCED_HIGH_</name>
							<description>Forced HIGH.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>POL_CLK</name>
					<description>USB need_clock polarity for triggering the USB wake-up interrupt</description>
					<bitRange>[1:1]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>FALLING_EDGE_OF_THE_</name>
							<description>Falling edge of the USB need_clock triggers the USB wake-up (default).</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>RISING_EDGE_OF_THE_U</name>
							<description>Rising edge of the USB need_clock triggers the USB wake-up.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[31:2]</bitRange>

				</field>
			</fields>
		</register>
		<register>
			<name>USBCLKST</name>
			<description>USB clock status</description>
			<addressOffset>0x130</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0x00000000</resetMask>
			<fields>
				<field>
					<name>NEED_CLKST</name>
					<description>USB need_clock signal status</description>
					<bitRange>[0:0]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>LOW</name>
							<description>LOW</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>HIGH</name>
							<description>HIGH</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[31:1]</bitRange>

