Manish-Subedi/embedded_Iot_project/ventilation_system/Debug/LPC15xx_peripheral.xml
				</field>
			</fields>
		</register>
		<register>
			<name>BODCTRL</name>
			<description>Brown-Out Detect</description>
			<addressOffset>0x180</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>BODRSTLEV</name>
					<description>BOD reset level</description>
					<bitRange>[1:0]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>LEVEL_0_THE_RESET_A</name>
							<description>Level 0: The reset assertion threshold voltage is ; the reset de-assertion threshold voltage is .</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>LEVEL_1_THE_RESET_A</name>
							<description>Level 1: The reset assertion threshold voltage is ; the reset de-assertion threshold voltage is .</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>LEVEL_2_THE_RESET_A</name>
							<description>Level 2: The reset assertion threshold voltage is ; the reset de-assertion threshold voltage is .</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>LEVEL_3_THE_RESET_A</name>
							<description>Level 3: The reset assertion threshold voltage is ; the reset de-assertion threshold voltage is.</description>
							<value>0x3</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>BODINTVAL</name>
					<description>BOD interrupt level</description>
					<bitRange>[3:2]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>LEVEL_0_THE_INTERRU</name>
							<description>Level 0: The interrupt assertion threshold voltage is ; the interrupt de-assertion threshold voltage is</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>LEVEL_1_THE_INTERRU</name>
							<description>Level 1: The interrupt assertion threshold voltage is  ; the interrupt de-assertion threshold voltage is .</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>LEVEL_2_THE_INTERRU</name>
							<description>Level 2: The interrupt assertion threshold voltage is ; the interrupt de-assertion threshold voltage is .</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>LEVEL_3_THE_INTERRU</name>
							<description>Level 3: The interrupt assertion threshold voltage is ; the interrupt de-assertion threshold voltage is .</description>
							<value>0x3</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>BODRSTENA</name>
					<description>BOD reset enable</description>
					<bitRange>[4:4]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>DISABLE_RESET_FUNCTI</name>
							<description>Disable reset function.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ENABLE_RESET_FUNCTIO</name>
							<description>Enable reset function.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[31:5]</bitRange>

				</field>
			</fields>
		</register>
		<register>
			<name>SYSOSCCTRL</name>
			<description>System oscillator control</description>
			<addressOffset>0x188</addressOffset>
			<access>read-write</access>
			<resetValue>0x000</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>BYPASS</name>
					<description>Bypass system oscillator</description>
					<bitRange>[0:0]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>DISABLED_OSCILLATOR</name>
							<description>Disabled. Oscillator is not bypassed.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ENABLED_PLL_INPUT_</name>
							<description>Enabled. PLL input (sys_osc_clk) is fed directly from the XTALIN pin bypassing the oscillator. Use this mode when using an external clock source instead of the crystal oscillator.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>FREQRANGE</name>
					<description>Determines frequency range for Low-power oscillator.</description>
					<bitRange>[1:1]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>1__20_MHZ_FREQUENCY</name>
							<description>1 - 20 MHz frequency range.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>15__25_MHZ_FREQUENC</name>
							<description>15 - 25 MHz frequency range</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[31:2]</bitRange>

				</field>
			</fields>
		</register>
		<register>
			<name>RTCOSCCTRL</name>
			<description>RTC oscillator control</description>
			<addressOffset>0x190</addressOffset>
			<access>read-write</access>
			<resetValue>0x1</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>EN</name>
					<description>RTC 32 kHz clock enable.</description>
					<bitRange>[0:0]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>DISABLED_RTC_CLOCK_</name>
							<description>Disabled. RTC clock off.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ENABLED_RTC_CLOCK_O</name>
							<description>Enabled. RTC clock on.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[31:1]</bitRange>

