Manish-Subedi/embedded_Iot_project/ventilation_system/Debug/LPC15xx_peripheral.xml
				</field>
			</fields>
		</register>
		<register>
			<name>PDRUNCFG</name>
			<description>Power configuration register</description>
			<addressOffset>0x208</addressOffset>
			<access>read-write</access>
			<resetValue>0xFFFFFF00</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[2:0]</bitRange>
				</field>
				<field>
					<name>IRCOUT_PD</name>
					<description>IRC oscillator output</description>
					<bitRange>[3:3]</bitRange>

					<enumeratedValues>
					<name>ENUM</name>

						<enumeratedValue>
							<name>POWERED</name>
							<description>Powered</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>POWERED_DOWN</name>
							<description>Powered down</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>IRC</name>
					<description>IRC oscillator</description>
					<bitRange>[4:4]</bitRange>

					<enumeratedValues>
					<name>ENUM</name>

						<enumeratedValue>
							<name>POWERED</name>
							<description>Powered</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>POWERED_DOWN</name>
							<description>Powered down</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>FLASH</name>
					<description>Flash memory</description>
					<bitRange>[5:5]</bitRange>

					<enumeratedValues>
					<name>ENUM</name>

						<enumeratedValue>
							<name>POWERED</name>
							<description>Powered</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>POWERED_DOWN</name>
							<description>Powered down</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>EEPROM</name>
					<description>EEPROM</description>
					<bitRange>[6:6]</bitRange>

					<enumeratedValues>
					<name>ENUM</name>

						<enumeratedValue>
							<name>POWERED</name>
							<description>Powered</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>POWERED_DOWN</name>
							<description>Powered down</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[7:7]</bitRange>

				</field>
				<field>
					<name>BOD_PD</name>
					<description>BOD power-down</description>
					<bitRange>[8:8]</bitRange>

					<enumeratedValues>
					<name>ENUM</name>

						<enumeratedValue>
							<name>POWERED</name>
							<description>Powered</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>POWERED_DOWN</name>
							<description>Powered down</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>USBPHY_PD</name>
					<description>USB PHY power-down</description>
					<bitRange>[9:9]</bitRange>

					<enumeratedValues>
					<name>ENUM</name>

						<enumeratedValue>
							<name>POWERED</name>
							<description>Powered</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>POWERED_DOWN</name>
							<description>Powered down</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>ADC0_PD</name>
					<description>ADC0 power-down</description>
					<bitRange>[10:10]</bitRange>

					<enumeratedValues>
					<name>ENUM</name>

						<enumeratedValue>
							<name>POWERED</name>
							<description>Powered</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>POWERED_DOWN</name>
							<description>Powered down</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>ADC1_PD</name>
					<description>ADC1 power-down</description>
					<bitRange>[11:11]</bitRange>

					<enumeratedValues>
					<name>ENUM</name>

						<enumeratedValue>
							<name>POWERED</name>
							<description>Powered</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>POWERED_DOWN</name>
							<description>Powered down</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>DAC_PD</name>
					<description>DAC power-down</description>
					<bitRange>[12:12]</bitRange>

					<enumeratedValues>
					<name>ENUM</name>

						<enumeratedValue>
							<name>POWERED</name>
							<description>Powered</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>POWERED_DOWN</name>
							<description>Powered down</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>ACMP0_PD</name>
					<description>Analog comparator 0 power-down</description>
					<bitRange>[13:13]</bitRange>

					<enumeratedValues>
					<name>ENUM</name>

						<enumeratedValue>
							<name>POWERED</name>
							<description>Powered</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>POWERED_DOWN</name>
							<description>Powered down</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>ACMP1_PD</name>
					<description>Analog comparator 1 power-down</description>
					<bitRange>[14:14]</bitRange>

					<enumeratedValues>
					<name>ENUM</name>

						<enumeratedValue>
							<name>POWERED</name>
							<description>Powered</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>POWERED_DOWN</name>
							<description>Powered down</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>ACMP2_PD</name>
					<description>Analog comparator 2 power-down</description>
					<bitRange>[15:15]</bitRange>

					<enumeratedValues>
					<name>ENUM</name>

						<enumeratedValue>
							<name>POWERED</name>
							<description>Powered</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>POWERED_DOWN</name>
							<description>Powered down</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>ACMP3_PD</name>
					<description>Analog comparator 3 power-down</description>
					<bitRange>[16:16]</bitRange>

					<enumeratedValues>
					<name>ENUM</name>

						<enumeratedValue>
							<name>POWERED</name>
							<description>Powered</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>POWERED_DOWN</name>
							<description>Powered down</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>IREF_PD</name>
					<description>Internal voltage reference power-down</description>
					<bitRange>[17:17]</bitRange>

					<enumeratedValues>
					<name>ENUM</name>

						<enumeratedValue>
							<name>POWERED</name>
							<description>Powered</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>POWERED_DOWN</name>
							<description>Powered down</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>TS_PD</name>
					<description>Temperature sensor power-down</description>
					<bitRange>[18:18]</bitRange>

					<enumeratedValues>
					<name>ENUM</name>

						<enumeratedValue>
							<name>POWERED</name>
							<description>Powered</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>POWERED_DOWN</name>
							<description>Powered down</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>VDDADIV_PD</name>
					<description>VDDA divider what is this for?</description>
					<bitRange>[19:19]</bitRange>

					<enumeratedValues>
					<name>ENUM</name>

						<enumeratedValue>
							<name>POWERED</name>
							<description>Powered</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>POWERED_DOWN</name>
							<description>Powered down</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>WDTOSC_PD</name>
					<description>Watchdog oscillator power-down .</description>
					<bitRange>[20:20]</bitRange>

					<enumeratedValues>
					<name>ENUM</name>

						<enumeratedValue>
							<name>POWERED</name>
							<description>Powered</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>POWERED_DOWN</name>
							<description>Powered down</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>SYSOSC_PD</name>
					<description>System oscillator power-down</description>
					<bitRange>[21:21]</bitRange>

					<enumeratedValues>
					<name>ENUM</name>

						<enumeratedValue>
							<name>POWERED</name>
							<description>Powered</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>POWERED_DOWN</name>
							<description>Powered down</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>SYSPLL_PD</name>
					<description>System PLL power-down</description>
					<bitRange>[22:22]</bitRange>

					<enumeratedValues>
					<name>ENUM</name>

						<enumeratedValue>
							<name>POWERED</name>
							<description>Powered</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>POWERED_DOWN</name>
							<description>Powered down</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>USBPLL_PD</name>
					<description>USB PLL power-down</description>
					<bitRange>[23:23]</bitRange>

					<enumeratedValues>
					<name>ENUM</name>

						<enumeratedValue>
							<name>POWERED</name>
							<description>Powered</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>POWERED_DOWN</name>
							<description>Powered down</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>SCTPLL_PD</name>
					<description>USB PLL power-down</description>
					<bitRange>[24:24]</bitRange>

					<enumeratedValues>
					<name>ENUM</name>

						<enumeratedValue>
							<name>POWERED</name>
							<description>Powered</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>POWERED_DOWN</name>
							<description>Powered down</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[31:25]</bitRange>

