Manish-Subedi/embedded_Iot_project/ventilation_system/Debug/LPC15xx_peripheral.xml
				</field>
			</fields>
		</register>
		<register>
			<name>STARTERP0</name>
			<description>Start logic 0 wake-up enable register</description>
			<addressOffset>0x218</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>WWDT</name>
					<description>WWDT interrupt wake-up.</description>
					<bitRange>[0:0]</bitRange>

					<enumeratedValues>
					<name>ENUM</name>

						<enumeratedValue>
							<name>DISABLED</name>
							<description>Disabled</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ENABLED</name>
							<description>Enabled</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>BOD</name>
					<description>BOD interrupt wake-up.</description>
					<bitRange>[1:1]</bitRange>

					<enumeratedValues>
					<name>ENUM</name>

						<enumeratedValue>
							<name>DISABLED</name>
							<description>Disabled</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ENABLED</name>
							<description>Enabled</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[4:2]</bitRange>

				</field>
				<field>
					<name>GINT0</name>
					<description>Group interrupt 0 wake-up.</description>
					<bitRange>[5:5]</bitRange>

					<enumeratedValues>
					<name>ENUM</name>

						<enumeratedValue>
							<name>DISABLED</name>
							<description>Disabled</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ENABLED</name>
							<description>Enabled</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>GINT1</name>
					<description>Group interrupt 1 wake-up.</description>
					<bitRange>[6:6]</bitRange>

					<enumeratedValues>
					<name>ENUM</name>

						<enumeratedValue>
							<name>DISABLED</name>
							<description>Disabled</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ENABLED</name>
							<description>Enabled</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>PINT0</name>
					<description>GPIO pin interrupt 0 wake-up</description>
					<bitRange>[7:7]</bitRange>

					<enumeratedValues>
					<name>ENUM</name>

						<enumeratedValue>
							<name>DISABLED</name>
							<description>Disabled</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ENABLED</name>
							<description>Enabled</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>PINT1</name>
					<description>GPIO pin interrupt 1 wake-up</description>
					<bitRange>[8:8]</bitRange>

					<enumeratedValues>
					<name>ENUM</name>

						<enumeratedValue>
							<name>DISABLED</name>
							<description>Disabled</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ENABLED</name>
							<description>Enabled</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>PINT2</name>
					<description>GPIO pin interrupt 2 wake-up</description>
					<bitRange>[9:9]</bitRange>

					<enumeratedValues>
					<name>ENUM</name>

						<enumeratedValue>
							<name>DISABLED</name>
							<description>Disabled</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ENABLED</name>
							<description>Enabled</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>PINT3</name>
					<description>GPIO pin interrupt 3 wake-up</description>
					<bitRange>[10:10]</bitRange>

					<enumeratedValues>
					<name>ENUM</name>

						<enumeratedValue>
							<name>DISABLED</name>
							<description>Disabled</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ENABLED</name>
							<description>Enabled</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>PINT4</name>
					<description>GPIO pin interrupt 4 wake-up</description>
					<bitRange>[11:11]</bitRange>

					<enumeratedValues>
					<name>ENUM</name>

						<enumeratedValue>
							<name>DISABLED</name>
							<description>Disabled</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ENABLED</name>
							<description>Enabled</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>PINT5</name>
					<description>GPIO pin interrupt 5 wake-up</description>
					<bitRange>[12:12]</bitRange>

					<enumeratedValues>
					<name>ENUM</name>

						<enumeratedValue>
							<name>DISABLED</name>
							<description>Disabled</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ENABLED</name>
							<description>Enabled</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>PINT6</name>
					<description>GPIO pin interrupt 6 wake-up</description>
					<bitRange>[13:13]</bitRange>

					<enumeratedValues>
					<name>ENUM</name>

						<enumeratedValue>
							<name>DISABLED</name>
							<description>Disabled</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ENABLED</name>
							<description>Enabled</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>PINT7</name>
					<description>GPIO pin interrupt 7 wake-up</description>
					<bitRange>[14:14]</bitRange>

					<enumeratedValues>
					<name>ENUM</name>

						<enumeratedValue>
							<name>DISABLED</name>
							<description>Disabled</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ENABLED</name>
							<description>Enabled</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[20:15]</bitRange>

