Manish-Subedi/embedded_Iot_project/ventilation_system/Debug/LPC15xx_peripheral.xml
				</field>
			</fields>
		</register>
		<register>
			<dim>14</dim>
			<dimIncrement>0x4</dimIncrement>
			<dimIndex>0-13</dimIndex>
			<name>PIO2_%s</name>
			<description>Digital I/O control for port 2 pins PIO2_0 to PIO2_13. Without glitch filter.</description>
			<addressOffset>0x100</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0x00000000</resetMask>
			<fields>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Only write 0 to these bits.</description>
					<bitRange>[2:0]</bitRange>

				</field>
				<field>
					<name>MODE</name>
					<description>Selects function mode (on-chip pull-up/pull-down resistor control).</description>
					<bitRange>[4:3]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>INACTIVE_NO_PULL_DO</name>
							<description>Inactive (no pull-down/pull-up resistor enabled).</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>PULL_DOWN_RESISTOR_E</name>
							<description>Pull-down resistor enabled.</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>PULL_UP_RESISTOR_ENA</name>
							<description>Pull-up resistor enabled.</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>REPEATER_MODE</name>
							<description>Repeater mode.</description>
							<value>0x3</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>HYS</name>
					<description>Hysteresis.</description>
					<bitRange>[5:5]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>DISABLE</name>
							<description>Disable.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ENABLE</name>
							<description>Enable.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>INV</name>
					<description>Invert input</description>
					<bitRange>[6:6]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>INPUT_NOT_INVERTED</name>
							<description>Input not inverted (HIGH on pin reads as 1; LOW on pin reads as 0).</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>INPUT_INVERTED_HIGH</name>
							<description>Input inverted (HIGH on pin reads as 0, LOW on pin reads as 1).</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[9:7]</bitRange>

				</field>
				<field>
					<name>OD</name>
					<description>Open-drain mode.</description>
					<bitRange>[10:10]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>DISABLE</name>
							<description>Disable.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>OPEN_DRAIN_MODE_ENAB</name>
							<description>Open-drain mode enabled.  This is not a true open-drain mode.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>S_MODE</name>
					<description>Digital filter sample mode.</description>
					<bitRange>[12:11]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>BYPASS_INPUT_FILTER</name>
							<description>Bypass input filter.</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>1_CLOCK_CYCLE</name>
							<description>1 clock cycle. Input pulses shorter than one filter clock are rejected.</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>2_CLOCK_CYCLES</name>
							<description>2 clock cycles. Input pulses shorter than two filter clocks are rejected.</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>3_CLOCK_CYCLES</name>
							<description>3 clock cycles. Input pulses shorter than three filter clocks are rejected.</description>
							<value>0x3</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>CLKDIV</name>
					<description>Select peripheral clock divider for input filter sampling clock IOCONCLKDIV. Value 0x7 is reserved.</description>
					<bitRange>[15:13]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>CMP_PCLK</name>
							<description>CMP_PCLK.</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>CMP_PCLKDIV2</name>
							<description>CMP_PCLK/2.</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>CMP_PCLKDIV4</name>
							<description>CMP_PCLK/4.</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>CMP_PCLKDIV8</name>
							<description>CMP_PCLK/8.</description>
							<value>0x3</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>CMP_PCLKDIV16</name>
							<description>CMP_PCLK/16.</description>
							<value>0x4</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>CMP_PCLKDIV32</name>
							<description>CMP_PCLK/32.</description>
							<value>0x5</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>CMP_PCLKDIV64</name>
							<description>CMP_PCLK/64.</description>
							<value>0x6</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[31:16]</bitRange>

				</field>
			</fields>
		</register>

	</registers>
</peripheral>

<peripheral>
	<name>MPU</name>
	<description>MPU (v7M)</description>
	<baseAddress>0xE000ED90</baseAddress>
	<registers>
		<register>
			<name>MPUTR</name>
			<description>MPU Type Register</description>
			<addressOffset>0x000</addressOffset>
			<size>32</size>
			<access>read-only</access>
			<fields>
				<field>
					<name>IREGION</name>
					<description>Number of instruction regions supported</description>
					<bitOffset>16</bitOffset>
					<bitWidth>8</bitWidth>
					<access>read-only</access>
				</field>
				<field>
					<name>DREGION</name>
					<description>Number regions supported</description>
					<bitOffset>8</bitOffset>
					<bitWidth>8</bitWidth>
					<access>read-only</access>
					<enumeratedValues>
						<enumeratedValue>
							<name>NotPresent</name>
							<description>Not present</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>EightRegions</name>
							<description>Eight regions</description>
							<value>8</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
			</fields>
		</register>
		<register>
			<name>MPUCR</name>
			<description>MPU Control Register</description>
			<addressOffset>0x004</addressOffset>
			<size>32</size>
			<access>read-write</access>
			<fields>
				<field>
					<name>PRIVDEFENA</name>
					<description>Privaleged default memory map enable</description>
					<bitOffset>2</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>HFNMIENA</name>
					<description>Enable the MPU during hard fault and NMI handler</description>
					<bitOffset>1</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
			</fields>
		</register>
		<register>
			<name>MPURNR</name>
			<description>MPU Region Number</description>
			<addressOffset>0x008</addressOffset>
			<size>8</size>
			<access>read-write</access>
		</register>
		<register>
			<name>MPURBAR</name>
			<description>MPU Region Base Address Register</description>
			<addressOffset>0x00c</addressOffset>
			<size>32</size>
			<access>read-write</access>
			<fields>
				<field>
					<name>ADDR</name>
					<description>Base address of region - not all bits significant - depends on region size</description>
					<bitOffset>5</bitOffset>
					<bitWidth>27</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>VALID</name>
					<description>A 1 indicates that REGION is valid</description>
					<bitOffset>4</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>REGION</name>
					<description>Region Number that overrides the MPU Region Number</description>
					<bitOffset>0</bitOffset>
					<bitWidth>4</bitWidth>
					<access>read-write</access>
				</field>
			</fields>
		</register>
		<register>
			<name>MPURASR</name>
			<description>MPU Region Attribute and Size Register</description>
			<addressOffset>0x010</addressOffset>
			<size>32</size>
			<access>read-write</access>
			<fields>
				<field>
					<name>XN</name>
					<description>Instruction  access disable bit</description>
					<bitOffset>28</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>AP</name>
					<description>Data Access Permission field</description>
					<bitOffset>24</bitOffset>
					<bitWidth>3</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>TEX</name>
					<description>Type Extension field</description>
					<bitOffset>19</bitOffset>
					<bitWidth>3</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>S</name>
					<description>Shareable region</description>
					<bitOffset>18</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>C</name>
					<description>Cacheable region</description>
					<bitOffset>17</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>B</name>
					<description>Bufferable region</description>
					<bitOffset>16</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SRD</name>
					<description>Subregion disable</description>
					<bitOffset>8</bitOffset>
					<bitWidth>8</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>REGION_SIZE</name>
					<description>MPU Protection Region size</description>
					<bitOffset>1</bitOffset>
					<bitWidth>5</bitWidth>
					<access>read-write</access>
					<enumeratedValues>
						<enumeratedValue>
							<name>Reserved</name>
							<description>Reserved</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>Reserved</name>
							<description>Reserved</description>
							<value>1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>Reserved</name>
							<description>Reserved</description>
							<value>2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>Reserved</name>
							<description>Reserved</description>
							<value>3</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>32Bytes</name>
							<description>32 bytes</description>
							<value>4</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>64Bytes</name>
							<description>64 bytes</description>
							<value>5</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>128Bytes</name>
							<description>128 bytes</description>
							<value>6</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>256Bytes</name>
							<description>256 bytes</description>
							<value>7</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>512Bytes</name>
							<description>512 bytes</description>
							<value>8</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>1KB</name>
							<description>1 KB</description>
							<value>9</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>2KB</name>
							<description>2 KB</description>
							<value>10</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>4KB</name>
							<description>4 KB</description>
							<value>11</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>8KB</name>
							<description>8 KB</description>
							<value>12</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>16KB</name>
							<description>16 KB</description>
							<value>13</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>32KB</name>
							<description>32 KB</description>
							<value>14</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>64KB</name>
							<description>64 KB</description>
							<value>15</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>128KB</name>
							<description>128 KB</description>
							<value>16</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>256KB</name>
							<description>256 KB</description>
							<value>17</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>512KB</name>
							<description>512 KB</description>
							<value>18</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>1MB</name>
							<description>1 MB</description>
							<value>19</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>2MB</name>
							<description>2 MB</description>
							<value>20</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>4MB</name>
							<description>4 MB</description>
							<value>21</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>8MB</name>
							<description>8 MB</description>
							<value>22</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>16MB</name>
							<description>16 MB</description>
							<value>23</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>32MB</name>
							<description>32 MB</description>
							<value>24</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>64MB</name>
							<description>64 MB</description>
							<value>25</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>128MB</name>
							<description>128 MB</description>
							<value>26</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>256MB</name>
							<description>256 MB</description>
							<value>27</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>512MB</name>
							<description>512 MB</description>
							<value>28</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>1GB</name>
							<description>1 GB</description>
							<value>29</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>2GB</name>
							<description>2 GB</description>
							<value>30</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>4GB</name>
							<description>4 GB</description>
							<value>31</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>SZENABLE</name>
					<description>Region Enable</description>
					<bitOffset>0</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
			</fields>
		</register>
		<register>
			<name>MPURBARa1</name>
			<description>MPU Region Base Address Register</description>
			<addressOffset>0x014</addressOffset>
			<size>32</size>
			<access>read-write</access>
		</register>
		<register>
			<name>MPURASRa1</name>
			<description>MPU Region Attribute and Size Register</description>
			<addressOffset>0x018</addressOffset>
			<size>32</size>
			<access>read-write</access>
		</register>
		<register>
			<name>MPURBARa2</name>
			<description>MPU Region Base Address Register</description>
			<addressOffset>0x01c</addressOffset>
			<size>32</size>
			<access>read-write</access>
		</register>
		<register>
			<name>MPURASRa2</name>
			<description>MPU Region Attribute and Size Register</description>
			<addressOffset>0x020</addressOffset>
			<size>32</size>
			<access>read-write</access>
		</register>
		<register>
			<name>MPURBARa3</name>
			<description>MPU Region Base Address Register</description>
			<addressOffset>0x024</addressOffset>
			<size>32</size>
			<access>read-write</access>
		</register>
		<register>
			<name>MPURASRa3</name>
			<description>MPU Region Attribute and Size Register</description>
			<addressOffset>0x028</addressOffset>
			<size>32</size>
			<access>read-write</access>
		</register>
