Manish-Subedi/embedded_Iot_project/ventilation_system/Debug/LPC15xx_peripheral.xml
	</registers>
</peripheral>
<peripheral>
	<name>DCR</name>
	<description>Debug Core Registers (v7M)</description>
	<baseAddress>0xE000EDF0</baseAddress>
	<registers>
		<register>
			<name>DHCSR</name>
			<description>Debug Halting Control and Status Register</description>
			<addressOffset>0x00</addressOffset>
			<size>32</size>
			<access>read-write</access>
			<fields>
				<field>
					<name>S_RESET_ST</name>
					<description>Indicates that the core has been reset</description>
					<bitOffset>25</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>S_RETIRE_ST</name>
					<description>Indicates that an instruction has completed since last read</description>
					<bitOffset>24</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>S_LOCKUP</name>
					<description>lockup condition is present</description>
					<bitOffset>19</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>S_SLEEP</name>
					<description>Indicates that the core is sleeping (WFI or WFE or SLEEP-ON-EXIT)</description>
					<bitOffset>18</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>S_HALT</name>
					<description>The core is in debug state when S_HALT is set</description>
					<bitOffset>17</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>S_REGRDY</name>
					<description>Register Read/Write on the Debug Core Register Selector register is available</description>
					<bitOffset>16</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>C_SNAPSTALL</name>
					<description>If the core is stalled on a load/store operation the stall ceases and the instruction is forced to complete.</description>
					<bitOffset>5</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>C_MASKINTS</name>
					<description>Mask interrupts when stepping or running in halted debug</description>
					<bitOffset>3</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>C_STEP</name>
					<description>Steps the core in halted debug</description>
					<bitOffset>2</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>C_HALT</name>
					<description>Halts the core</description>
					<bitOffset>1</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>C_DEBUGEN</name>
					<description>Enables debug</description>
					<bitOffset>0</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
			</fields>
		</register>
		<register>
			<name>DCSR</name>
			<description>Debug Core Register Selector Register</description>
			<addressOffset>0x04</addressOffset>
			<size>32</size>
			<fields>
				<field>
					<name>REGWnR</name>
					<description>REGWnR</description>
					<bitOffset>16</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>REGSEL</name>
					<description>REGSEL</description>
					<bitOffset>0</bitOffset>
					<bitWidth>5</bitWidth>
					<access>read-write</access>
				</field>
			</fields>
		</register>
		<register>
			<name>DCRDR</name>
			<description>Debug Core Register Data Register</description>
			<addressOffset>0x08</addressOffset>
			<size>32</size>
			<access>read-write</access>
		</register>
		<register>
			<name>DEMCR</name>
			<description>Debug Exception and Monitor Control Register</description>
			<addressOffset>0x0c</addressOffset>
			<size>32</size>
			<access>read-write</access>
			<fields>
				<field>
					<name>TRCENA</name>
					<description>This bit must be set to 1 to enable use of the trace and debug blocks</description>
					<bitOffset>24</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>MON_REQ</name>
					<description>This enables the monitor to identify how it wakes up</description>
					<bitOffset>19</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>MON_STEP</name>
					<description>When MON_EN = 1 this steps the core.</description>
					<bitOffset>18</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>MON_PEND</name>
					<description>Pend the monitor to activate when priority permits</description>
					<bitOffset>17</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>MON_EN</name>
					<description>Enable the debug monitor</description>
					<bitOffset>16</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>VC_HARDERR</name>
					<description>Debug trap on Hard Fault.</description>
					<bitOffset>10</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>VC_INTERR</name>
					<description>Debug Trap on interrupt/exception service errors</description>
					<bitOffset>9</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>VC_BUSERR</name>
					<description>Debug Trap on normal Bus error.</description>
					<bitOffset>8</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>VC_STATERR</name>
					<description>Debug trap on Usage Fault state errors.</description>
					<bitOffset>7</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>VC_CHKERR</name>
					<description>Debug trap on Usage Fault enabled checking errors.</description>
					<bitOffset>6</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>VC_NOCPERR</name>
					<description>Debug trap on Usage Fault access to Coprocessor</description>
					<bitOffset>5</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>VC_MMERR</name>
					<description>Debug trap on Memory Management faults</description>
					<bitOffset>4</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>VC_CORERESET</name>
					<description>Reset Vector Catch. Halt running system if Core reset occurs.</description>
					<bitOffset>0</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
			</fields>
		</register>
