Manish-Subedi/embedded_Iot_project/ventilation_system/Debug/LPC15xx_peripheral.xml
	</registers>
</peripheral>
<peripheral>
	<name>NVIC</name>
	<description>NVIC Control/Status Regsiters (v7M)</description>
	<baseAddress>0xE000E000</baseAddress>
	<registers>
		<register>
			<name>ICTR</name>
			<description>Number of Interrupts (0 = 1-32 1 = 33-64)</description>
			<addressOffset>0x008</addressOffset>
			<size>32</size>
			<access>read-write</access>
		</register>
		<register>
			<name>SCB_ACTLR</name>
			<description>Auxiliary control register</description>
			<addressOffset>0x008</addressOffset>
			<size>32</size>
			<access>read-write</access>
		</register>
		<register>
			<name>SYSTICK_CTRL</name>
			<description>SysTick Control and Status Register</description>
			<addressOffset>0x010</addressOffset>
			<size>32</size>
			<access>read-write</access>
		</register>
		<register>
			<name>SYSTICK_LOAD</name>
			<description>SysTick Reload Value Register</description>
			<addressOffset>0x014</addressOffset>
			<size>32</size>
			<access>read-write</access>
		</register>
		<register>
			<name>SYSTICK_VAL</name>
			<description>SysTick Current Value Register</description>
			<addressOffset>0x018</addressOffset>
			<size>32</size>
			<access>read-write</access>
		</register>
		<register>
			<name>SYSTICK_CALIB</name>
			<description>SysTick Calibration Value Register</description>
			<addressOffset>0x01c</addressOffset>
			<size>32</size>
			<access>read-write</access>
		</register>
		<register>
			<name>NVIC_ISER0</name>
			<description>NVIC Set Enable Register 0 for interrupts 0 to 31</description>
			<addressOffset>0x100</addressOffset>
			<size>32</size>
			<access>read-write</access>
		    <fields>
				<field>
					<name>SetEnable_31</name>
					<description>Set Enable for interrupt #31 (exception #47)</description>
					<bitOffset>31</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SetEnable_30</name>
					<description>Set Enable for interrupt #30 (exception #46)</description>
					<bitOffset>30</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SetEnable_29</name>
					<description>Set Enable for interrupt #29 (exception #45)</description>
					<bitOffset>29</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SetEnable_28</name>
					<description>Set Enable for interrupt #28 (exception #44)</description>
					<bitOffset>28</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SetEnable_27</name>
					<description>Set Enable for interrupt #27 (exception #43)</description>
					<bitOffset>27</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SetEnable_26</name>
					<description>Set Enable for interrupt #26 (exception #42)</description>
					<bitOffset>26</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SetEnable_25</name>
					<description>Set Enable for interrupt #25 (exception #41)</description>
					<bitOffset>25</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SetEnable_24</name>
					<description>Set Enable for interrupt #24 (exception #40)</description>
					<bitOffset>24</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SetEnable_23</name>
					<description>Set Enable for interrupt #23 (exception #39)</description>
					<bitOffset>23</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SetEnable_22</name>
					<description>Set Enable for interrupt #22 (exception #38)</description>
					<bitOffset>22</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SetEnable_21</name>
					<description>Set Enable for interrupt #21 (exception #37)</description>
					<bitOffset>21</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SetEnable_20</name>
					<description>Set Enable for interrupt #20 (exception #36)</description>
					<bitOffset>20</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SetEnable_19</name>
					<description>Set Enable for interrupt #19 (exception #35)</description>
					<bitOffset>19</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SetEnable_18</name>
					<description>Set Enable for interrupt #18 (exception #34)</description>
					<bitOffset>18</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SetEnable_17</name>
					<description>Set Enable for interrupt #17 (exception #33)</description>
					<bitOffset>17</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SetEnable_16</name>
					<description>Set Enable for interrupt #16 (exception #32)</description>
					<bitOffset>16</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SetEnable_15</name>
					<description>Set Enable for interrupt #15 (exception #31)</description>
					<bitOffset>15</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SetEnable_14</name>
					<description>Set Enable for interrupt #14 (exception #30)</description>
					<bitOffset>14</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SetEnable_13</name>
					<description>Set Enable for interrupt #13 (exception #29)</description>
					<bitOffset>13</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SetEnable_12</name>
					<description>Set Enable for interrupt #12 (exception #28)</description>
					<bitOffset>12</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SetEnable_11</name>
					<description>Set Enable for interrupt #11 (exception #27)</description>
					<bitOffset>11</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SetEnable_10</name>
					<description>Set Enable for interrupt #10 (exception #26)</description>
					<bitOffset>10</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SetEnable_09</name>
					<description>Set Enable for interrupt #09 (exception #25)</description>
					<bitOffset>09</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SetEnable_08</name>
					<description>Set Enable for interrupt #08 (exception #24)</description>
					<bitOffset>08</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SetEnable_07</name>
					<description>Set Enable for interrupt #07 (exception #23)</description>
					<bitOffset>07</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SetEnable_06</name>
					<description>Set Enable for interrupt #06 (exception #22)</description>
					<bitOffset>06</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SetEnable_05</name>
					<description>Set Enable for interrupt #05 (exception #21)</description>
					<bitOffset>05</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SetEnable_04</name>
					<description>Set Enable for interrupt #04 (exception #20)</description>
					<bitOffset>04</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SetEnable_03</name>
					<description>Set Enable for interrupt #03 (exception #19)</description>
					<bitOffset>03</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SetEnable_02</name>
					<description>Set Enable for interrupt #02 (exception #18)</description>
					<bitOffset>02</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SetEnable_01</name>
					<description>Set Enable for interrupt #01 (exception #17)</description>
					<bitOffset>01</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SetEnable_00</name>
					<description>Set Enable for interrupt #00 (exception #16)</description>
					<bitOffset>00</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
			</fields>
		</register>
		<register>
			<name>NVIC_ISER1</name>
			<description>NVIC Set Enable Register 1 for interrupts 0 to 31</description>
			<addressOffset>0x104</addressOffset>
			<size>32</size>
			<access>read-write</access>
		    <fields>
				<field>
					<name>SetEnable_63</name>
					<description>Set Enable for interrupt #31 (exception #79)</description>
					<bitOffset>31</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SetEnable_62</name>
					<description>Set Enable for interrupt #62 (exception #78)</description>
					<bitOffset>30</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SetEnable_61</name>
					<description>Set Enable for interrupt #61 (exception #77)</description>
					<bitOffset>29</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SetEnable_60</name>
					<description>Set Enable for interrupt #60 (exception #76)</description>
					<bitOffset>28</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SetEnable_59</name>
					<description>Set Enable for interrupt #59 (exception #75)</description>
					<bitOffset>27</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SetEnable_58</name>
					<description>Set Enable for interrupt #58 (exception #74)</description>
					<bitOffset>26</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SetEnable_57</name>
					<description>Set Enable for interrupt #57 (exception #73)</description>
					<bitOffset>25</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SetEnable_56</name>
					<description>Set Enable for interrupt #56 (exception #72)</description>
					<bitOffset>24</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SetEnable_55</name>
					<description>Set Enable for interrupt #55 (exception #71)</description>
					<bitOffset>23</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SetEnable_54</name>
					<description>Set Enable for interrupt #54 (exception #70)</description>
					<bitOffset>22</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SetEnable_53</name>
					<description>Set Enable for interrupt #53 (exception #69)</description>
					<bitOffset>21</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SetEnable_52</name>
					<description>Set Enable for interrupt #52 (exception #68)</description>
					<bitOffset>20</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SetEnable_51</name>
					<description>Set Enable for interrupt #51 (exception #67)</description>
					<bitOffset>19</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SetEnable_50</name>
					<description>Set Enable for interrupt #50 (exception #66)</description>
					<bitOffset>18</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SetEnable_49</name>
					<description>Set Enable for interrupt #49 (exception #65)</description>
					<bitOffset>17</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SetEnable_48</name>
					<description>Set Enable for interrupt #48 (exception #64)</description>
					<bitOffset>16</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SetEnable_47</name>
					<description>Set Enable for interrupt #47 (exception #63)</description>
					<bitOffset>15</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SetEnable_46</name>
					<description>Set Enable for interrupt #46 (exception #62)</description>
					<bitOffset>14</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SetEnable_45</name>
					<description>Set Enable for interrupt #45 (exception #61)</description>
					<bitOffset>13</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SetEnable_44</name>
					<description>Set Enable for interrupt #44 (exception #60)</description>
					<bitOffset>12</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SetEnable_43</name>
					<description>Set Enable for interrupt #43 (exception #59)</description>
					<bitOffset>11</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SetEnable_42</name>
					<description>Set Enable for interrupt #42 (exception #58)</description>
					<bitOffset>10</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SetEnable_41</name>
					<description>Set Enable for interrupt #41 (exception #57)</description>
					<bitOffset>09</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SetEnable_40</name>
					<description>Set Enable for interrupt #40 (exception #56)</description>
					<bitOffset>08</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SetEnable_39</name>
					<description>Set Enable for interrupt #39 (exception #55)</description>
					<bitOffset>07</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SetEnable_38</name>
					<description>Set Enable for interrupt #38 (exception #54)</description>
					<bitOffset>06</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SetEnable_37</name>
					<description>Set Enable for interrupt #37 (exception #53)</description>
					<bitOffset>05</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SetEnable_36</name>
					<description>Set Enable for interrupt #36 (exception #52)</description>
					<bitOffset>04</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SetEnable_35</name>
					<description>Set Enable for interrupt #35 (exception #51)</description>
					<bitOffset>03</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SetEnable_34</name>
					<description>Set Enable for interrupt #34 (exception #50)</description>
					<bitOffset>02</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SetEnable_33</name>
					<description>Set Enable for interrupt #33 (exception #49)</description>
					<bitOffset>01</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SetEnable_32</name>
					<description>Set Enable for interrupt #32 (exception #48)</description>
					<bitOffset>00</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
			</fields>
		</register>
		<register>
			<name>NVIC_ICER0</name>
			<description>NVIC Clear Enable Register 0 for interrupts 0 to 31</description>
			<addressOffset>0x180</addressOffset>
			<size>32</size>
			<access>read-write</access>
		    <fields>
				<field>
					<name>ClearEnable_31</name>
					<description>Clear Enable for interrupt #31 (exception #47)</description>
					<bitOffset>31</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ClearEnable_30</name>
					<description>Clear Enable for interrupt #30 (exception #46)</description>
					<bitOffset>30</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ClearEnable_29</name>
					<description>Clear Enable for interrupt #29 (exception #45)</description>
					<bitOffset>29</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ClearEnable_28</name>
					<description>Clear Enable for interrupt #28 (exception #44)</description>
					<bitOffset>28</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ClearEnable_27</name>
					<description>Clear Enable for interrupt #27 (exception #43)</description>
					<bitOffset>27</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ClearEnable_26</name>
					<description>Clear Enable for interrupt #26 (exception #42)</description>
					<bitOffset>26</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ClearEnable_25</name>
					<description>Clear Enable for interrupt #25 (exception #41)</description>
					<bitOffset>25</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ClearEnable_24</name>
					<description>Clear Enable for interrupt #24 (exception #40)</description>
					<bitOffset>24</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ClearEnable_23</name>
					<description>Clear Enable for interrupt #23 (exception #39)</description>
					<bitOffset>23</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ClearEnable_22</name>
					<description>Clear Enable for interrupt #22 (exception #38)</description>
					<bitOffset>22</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ClearEnable_21</name>
					<description>Clear Enable for interrupt #21 (exception #37)</description>
					<bitOffset>21</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ClearEnable_20</name>
					<description>Clear Enable for interrupt #20 (exception #36)</description>
					<bitOffset>20</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ClearEnable_19</name>
					<description>Clear Enable for interrupt #19 (exception #35)</description>
					<bitOffset>19</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ClearEnable_18</name>
					<description>Clear Enable for interrupt #18 (exception #34)</description>
					<bitOffset>18</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ClearEnable_17</name>
					<description>Clear Enable for interrupt #17 (exception #33)</description>
					<bitOffset>17</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ClearEnable_16</name>
					<description>Clear Enable for interrupt #16 (exception #32)</description>
					<bitOffset>16</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ClearEnable_15</name>
					<description>Clear Enable for interrupt #15 (exception #31)</description>
					<bitOffset>15</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ClearEnable_14</name>
					<description>Clear Enable for interrupt #14 (exception #30)</description>
					<bitOffset>14</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ClearEnable_13</name>
					<description>Clear Enable for interrupt #13 (exception #29)</description>
					<bitOffset>13</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ClearEnable_12</name>
					<description>Clear Enable for interrupt #12 (exception #28)</description>
					<bitOffset>12</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ClearEnable_11</name>
					<description>Clear Enable for interrupt #11 (exception #27)</description>
					<bitOffset>11</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ClearEnable_10</name>
					<description>Clear Enable for interrupt #10 (exception #26)</description>
					<bitOffset>10</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ClearEnable_09</name>
					<description>Clear Enable for interrupt #09 (exception #25)</description>
					<bitOffset>09</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ClearEnable_08</name>
					<description>Clear Enable for interrupt #08 (exception #24)</description>
					<bitOffset>08</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ClearEnable_07</name>
					<description>Clear Enable for interrupt #07 (exception #23)</description>
					<bitOffset>07</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ClearEnable_06</name>
					<description>Clear Enable for interrupt #06 (exception #22)</description>
					<bitOffset>06</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ClearEnable_05</name>
					<description>Clear Enable for interrupt #05 (exception #21)</description>
					<bitOffset>05</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ClearEnable_04</name>
					<description>Clear Enable for interrupt #04 (exception #20)</description>
					<bitOffset>04</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ClearEnable_03</name>
					<description>Clear Enable for interrupt #03 (exception #19)</description>
					<bitOffset>03</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ClearEnable_02</name>
					<description>Clear Enable for interrupt #02 (exception #18)</description>
					<bitOffset>02</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ClearEnable_01</name>
					<description>Clear Enable for interrupt #01 (exception #17)</description>
					<bitOffset>01</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ClearEnable_00</name>
					<description>Clear Enable for interrupt #00 (exception #16)</description>
					<bitOffset>00</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
			</fields>
		</register>
