Manish-Subedi/embedded_Iot_project/ventilation_system/Debug/LPC15xx_peripheral.xml
		<register>
			<name>NVIC_ICER1</name>
			<description>NVIC Clear Enable Register 1 for interrupts 0 to 31</description>
			<addressOffset>0x184</addressOffset>
			<size>32</size>
			<access>read-write</access>
		    <fields>
				<field>
					<name>ClearEnable_63</name>
					<description>Clear Enable for interrupt #63 (exception #79)</description>
					<bitOffset>31</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ClearEnable_62</name>
					<description>Clear Enable for interrupt #62 (exception #78)</description>
					<bitOffset>30</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ClearEnable_61</name>
					<description>Clear Enable for interrupt #61 (exception #77)</description>
					<bitOffset>29</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ClearEnable_60</name>
					<description>Clear Enable for interrupt #60 (exception #76)</description>
					<bitOffset>28</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ClearEnable_59</name>
					<description>Clear Enable for interrupt #59 (exception #75)</description>
					<bitOffset>27</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ClearEnable_58</name>
					<description>Clear Enable for interrupt #58 (exception #74)</description>
					<bitOffset>26</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ClearEnable_57</name>
					<description>Clear Enable for interrupt #57 (exception #73)</description>
					<bitOffset>25</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ClearEnable_56</name>
					<description>Clear Enable for interrupt #56 (exception #72)</description>
					<bitOffset>24</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ClearEnable_55</name>
					<description>Clear Enable for interrupt #55 (exception #71)</description>
					<bitOffset>23</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ClearEnable_54</name>
					<description>Clear Enable for interrupt #54 (exception #70)</description>
					<bitOffset>22</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ClearEnable_53</name>
					<description>Clear Enable for interrupt #53 (exception #69)</description>
					<bitOffset>21</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ClearEnable_52</name>
					<description>Clear Enable for interrupt #52 (exception #68)</description>
					<bitOffset>20</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ClearEnable_51</name>
					<description>Clear Enable for interrupt #51 (exception #67)</description>
					<bitOffset>19</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ClearEnable_50</name>
					<description>Clear Enable for interrupt #50 (exception #66)</description>
					<bitOffset>18</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ClearEnable_49</name>
					<description>Clear Enable for interrupt #49 (exception #65)</description>
					<bitOffset>17</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ClearEnable_48</name>
					<description>Clear Enable for interrupt #48 (exception #64)</description>
					<bitOffset>16</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ClearEnable_47</name>
					<description>Clear Enable for interrupt #47 (exception #63)</description>
					<bitOffset>15</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ClearEnable_46</name>
					<description>Clear Enable for interrupt #46 (exception #62)</description>
					<bitOffset>14</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ClearEnable_45</name>
					<description>Clear Enable for interrupt #45 (exception #61)</description>
					<bitOffset>13</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ClearEnable_44</name>
					<description>Clear Enable for interrupt #44 (exception #60)</description>
					<bitOffset>12</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ClearEnable_43</name>
					<description>Clear Enable for interrupt #43 (exception #59)</description>
					<bitOffset>11</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ClearEnable_42</name>
					<description>Clear Enable for interrupt #42 (exception #58)</description>
					<bitOffset>10</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ClearEnable_41</name>
					<description>Clear Enable for interrupt #41 (exception #57)</description>
					<bitOffset>09</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ClearEnable_40</name>
					<description>Clear Enable for interrupt #40 (exception #56)</description>
					<bitOffset>08</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ClearEnable_39</name>
					<description>Clear Enable for interrupt #39 (exception #55)</description>
					<bitOffset>07</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ClearEnable_38</name>
					<description>Clear Enable for interrupt #38 (exception #54)</description>
					<bitOffset>06</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ClearEnable_37</name>
					<description>Clear Enable for interrupt #37 (exception #53)</description>
					<bitOffset>05</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ClearEnable_36</name>
					<description>Clear Enable for interrupt #36 (exception #52)</description>
					<bitOffset>04</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ClearEnable_35</name>
					<description>Clear Enable for interrupt #35 (exception #51)</description>
					<bitOffset>03</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ClearEnable_34</name>
					<description>Clear Enable for interrupt #34 (exception #50)</description>
					<bitOffset>02</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ClearEnable_33</name>
					<description>Clear Enable for interrupt #33 (exception #49)</description>
					<bitOffset>01</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ClearEnable_32</name>
					<description>Clear Enable for interrupt #32 (exception #48)</description>
					<bitOffset>00</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
			</fields>
		</register>
		<register>
			<name>NVIC_ISPR0</name>
			<description>NVIC Set Pending Register 0 for interrupts 0 to 31</description>
			<addressOffset>0x200</addressOffset>
			<size>32</size>
			<access>read-write</access>
		    <fields>
				<field>
					<name>SetPend_31</name>
					<description>Set Pending for interrupt #31 (exception #47)</description>
					<bitOffset>31</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SetPend_30</name>
					<description>Set Pending for interrupt #30 (exception #46)</description>
					<bitOffset>30</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SetPend_29</name>
					<description>Set Pending for interrupt #29 (exception #45)</description>
					<bitOffset>29</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SetPend_28</name>
					<description>Set Pending for interrupt #28 (exception #44)</description>
					<bitOffset>28</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SetPend_27</name>
					<description>Set Pending for interrupt #27 (exception #43)</description>
					<bitOffset>27</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SetPend_26</name>
					<description>Set Pending for interrupt #26 (exception #42)</description>
					<bitOffset>26</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SetPend_25</name>
					<description>Set Pending for interrupt #25 (exception #41)</description>
					<bitOffset>25</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SetPend_24</name>
					<description>Set Pending for interrupt #24 (exception #40)</description>
					<bitOffset>24</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SetPend_23</name>
					<description>Set Pending for interrupt #23 (exception #39)</description>
					<bitOffset>23</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SetPend_22</name>
					<description>Set Pending for interrupt #22 (exception #38)</description>
					<bitOffset>22</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SetPend_21</name>
					<description>Set Pending for interrupt #21 (exception #37)</description>
					<bitOffset>21</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SetPend_20</name>
					<description>Set Pending for interrupt #20 (exception #36)</description>
					<bitOffset>20</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SetPend_19</name>
					<description>Set Pending for interrupt #19 (exception #35)</description>
					<bitOffset>19</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SetPend_18</name>
					<description>Set Pending for interrupt #18 (exception #34)</description>
					<bitOffset>18</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SetPend_17</name>
					<description>Set Pending for interrupt #17 (exception #33)</description>
					<bitOffset>17</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SetPend_16</name>
					<description>Set Pending for interrupt #16 (exception #32)</description>
					<bitOffset>16</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SetPend_15</name>
					<description>Set Pending for interrupt #15 (exception #31)</description>
					<bitOffset>15</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SetPend_14</name>
					<description>Set Pending for interrupt #14 (exception #30)</description>
					<bitOffset>14</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SetPend_13</name>
					<description>Set Pending for interrupt #13 (exception #29)</description>
					<bitOffset>13</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SetPend_12</name>
					<description>Set Pending for interrupt #12 (exception #28)</description>
					<bitOffset>12</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SetPend_11</name>
					<description>Set Pending for interrupt #11 (exception #27)</description>
					<bitOffset>11</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SetPend_10</name>
					<description>Set Pending for interrupt #10 (exception #26)</description>
					<bitOffset>10</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SetPend_09</name>
					<description>Set Pending for interrupt #09 (exception #25)</description>
					<bitOffset>09</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SetPend_08</name>
					<description>Set Pending for interrupt #08 (exception #24)</description>
					<bitOffset>08</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SetPend_07</name>
					<description>Set Pending for interrupt #07 (exception #23)</description>
					<bitOffset>07</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SetPend_06</name>
					<description>Set Pending for interrupt #06 (exception #22)</description>
					<bitOffset>06</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SetPend_05</name>
					<description>Set Pending for interrupt #05 (exception #21)</description>
					<bitOffset>05</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SetPend_04</name>
					<description>Set Pending for interrupt #04 (exception #20)</description>
					<bitOffset>04</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SetPend_03</name>
					<description>Set Pending for interrupt #03 (exception #19)</description>
					<bitOffset>03</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SetPend_02</name>
					<description>Set Pending for interrupt #02 (exception #18)</description>
					<bitOffset>02</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SetPend_01</name>
					<description>Set Pending for interrupt #01 (exception #17)</description>
					<bitOffset>01</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SetPend_00</name>
					<description>Set Pending for interrupt #00 (exception #16)</description>
					<bitOffset>00</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
			</fields>
		</register>
		<register>
			<name>NVIC_ISPR1</name>
			<description>NVIC Set Pending Register 1 for interrupts 0 to 31</description>
			<addressOffset>0x204</addressOffset>
			<size>32</size>
			<access>read-write</access>
		    <fields>
				<field>
					<name>SetPend_63</name>
					<description>Set Pending for interrupt #63 (exception #79)</description>
					<bitOffset>31</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SetPend_62</name>
					<description>Set Pending for interrupt #62 (exception #78)</description>
					<bitOffset>30</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SetPend_61</name>
					<description>Set Pending for interrupt #61 (exception #77)</description>
					<bitOffset>29</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SetPend_60</name>
					<description>Set Pending for interrupt #60 (exception #76)</description>
					<bitOffset>28</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SetPend_59</name>
					<description>Set Pending for interrupt #59 (exception #75)</description>
					<bitOffset>27</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SetPend_58</name>
					<description>Set Pending for interrupt #58 (exception #74)</description>
					<bitOffset>26</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SetPend_57</name>
					<description>Set Pending for interrupt #57 (exception #73)</description>
					<bitOffset>25</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SetPend_56</name>
					<description>Set Pending for interrupt #56 (exception #72)</description>
					<bitOffset>24</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SetPend_55</name>
					<description>Set Pending for interrupt #55 (exception #71)</description>
					<bitOffset>23</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SetPend_54</name>
					<description>Set Pending for interrupt #54 (exception #70)</description>
					<bitOffset>22</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SetPend_53</name>
					<description>Set Pending for interrupt #53 (exception #69)</description>
					<bitOffset>21</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SetPend_52</name>
					<description>Set Pending for interrupt #52 (exception #68)</description>
					<bitOffset>20</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SetPend_51</name>
					<description>Set Pending for interrupt #51 (exception #67)</description>
					<bitOffset>19</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SetPend_50</name>
					<description>Set Pending for interrupt #50 (exception #66)</description>
					<bitOffset>18</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SetPend_49</name>
					<description>Set Pending for interrupt #49 (exception #65)</description>
					<bitOffset>17</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SetPend_48</name>
					<description>Set Pending for interrupt #48 (exception #64)</description>
					<bitOffset>16</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SetPend_47</name>
					<description>Set Pending for interrupt #47 (exception #63)</description>
					<bitOffset>15</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SetPend_46</name>
					<description>Set Pending for interrupt #46 (exception #62)</description>
					<bitOffset>14</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SetPend_45</name>
					<description>Set Pending for interrupt #45 (exception #61)</description>
					<bitOffset>13</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SetPend_44</name>
					<description>Set Pending for interrupt #44 (exception #60)</description>
					<bitOffset>12</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SetPend_43</name>
					<description>Set Pending for interrupt #43 (exception #59)</description>
					<bitOffset>11</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SetPend_42</name>
					<description>Set Pending for interrupt #42 (exception #58)</description>
					<bitOffset>10</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SetPend_41</name>
					<description>Set Pending for interrupt #41 (exception #57)</description>
					<bitOffset>09</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SetPend_40</name>
					<description>Set Pending for interrupt #40 (exception #56)</description>
					<bitOffset>08</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SetPend_39</name>
					<description>Set Pending for interrupt #39 (exception #55)</description>
					<bitOffset>07</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SetPend_38</name>
					<description>Set Pending for interrupt #38 (exception #54)</description>
					<bitOffset>06</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SetPend_37</name>
					<description>Set Pending for interrupt #37 (exception #53)</description>
					<bitOffset>05</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SetPend_36</name>
					<description>Set Pending for interrupt #36 (exception #52)</description>
					<bitOffset>04</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SetPend_35</name>
					<description>Set Pending for interrupt #35 (exception #51)</description>
					<bitOffset>03</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SetPend_34</name>
					<description>Set Pending for interrupt #34 (exception #50)</description>
					<bitOffset>02</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SetPend_33</name>
					<description>Set Pending for interrupt #33 (exception #49)</description>
					<bitOffset>01</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SetPend_32</name>
					<description>Set Pending for interrupt #32 (exception #48)</description>
					<bitOffset>00</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
			</fields>
		</register>
