Manish-Subedi/embedded_Iot_project/ventilation_system/Debug/LPC15xx_peripheral.xml
		<register>
			<name>NVIC_ICPR0</name>
			<description>NVIC Clear Pending Register 0 for interrupts 0 to 31</description>
			<addressOffset>0x280</addressOffset>
			<size>32</size>
			<access>read-write</access>
		    <fields>
				<field>
					<name>ClearPende_31</name>
					<description>Clear Pending for interrupt #31 (exception #47)</description>
					<bitOffset>31</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ClearPende_30</name>
					<description>Clear Pending for interrupt #30 (exception #46)</description>
					<bitOffset>30</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ClearPende_29</name>
					<description>Clear Pending for interrupt #29 (exception #45)</description>
					<bitOffset>29</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ClearPende_28</name>
					<description>Clear Pending for interrupt #28 (exception #44)</description>
					<bitOffset>28</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ClearPende_27</name>
					<description>Clear Pending for interrupt #27 (exception #43)</description>
					<bitOffset>27</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ClearPende_26</name>
					<description>Clear Pending for interrupt #26 (exception #42)</description>
					<bitOffset>26</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ClearPende_25</name>
					<description>Clear Pending for interrupt #25 (exception #41)</description>
					<bitOffset>25</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ClearPende_24</name>
					<description>Clear Pending for interrupt #24 (exception #40)</description>
					<bitOffset>24</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ClearPende_23</name>
					<description>Clear Pending for interrupt #23 (exception #39)</description>
					<bitOffset>23</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ClearPende_22</name>
					<description>Clear Pending for interrupt #22 (exception #38)</description>
					<bitOffset>22</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ClearPende_21</name>
					<description>Clear Pending for interrupt #21 (exception #37)</description>
					<bitOffset>21</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ClearPende_20</name>
					<description>Clear Pending for interrupt #20 (exception #36)</description>
					<bitOffset>20</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ClearPende_19</name>
					<description>Clear Pending for interrupt #19 (exception #35)</description>
					<bitOffset>19</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ClearPende_18</name>
					<description>Clear Pending for interrupt #18 (exception #34)</description>
					<bitOffset>18</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ClearPende_17</name>
					<description>Clear Pending for interrupt #17 (exception #33)</description>
					<bitOffset>17</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ClearPende_16</name>
					<description>Clear Pending for interrupt #16 (exception #32)</description>
					<bitOffset>16</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ClearPende_15</name>
					<description>Clear Pending for interrupt #15 (exception #31)</description>
					<bitOffset>15</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ClearPende_14</name>
					<description>Clear Pending for interrupt #14 (exception #30)</description>
					<bitOffset>14</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ClearPende_13</name>
					<description>Clear Pending for interrupt #13 (exception #29)</description>
					<bitOffset>13</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ClearPende_12</name>
					<description>Clear Pending for interrupt #12 (exception #28)</description>
					<bitOffset>12</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ClearPende_11</name>
					<description>Clear Pending for interrupt #11 (exception #27)</description>
					<bitOffset>11</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ClearPende_10</name>
					<description>Clear Pending for interrupt #10 (exception #26)</description>
					<bitOffset>10</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ClearPende_09</name>
					<description>Clear Pending for interrupt #09 (exception #25)</description>
					<bitOffset>09</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ClearPende_08</name>
					<description>Clear Pending for interrupt #08 (exception #24)</description>
					<bitOffset>08</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ClearPende_07</name>
					<description>Clear Pending for interrupt #07 (exception #23)</description>
					<bitOffset>07</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ClearPende_06</name>
					<description>Clear Pending for interrupt #06 (exception #22)</description>
					<bitOffset>06</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ClearPende_05</name>
					<description>Clear Pending for interrupt #05 (exception #21)</description>
					<bitOffset>05</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ClearPende_04</name>
					<description>Clear Pending for interrupt #04 (exception #20)</description>
					<bitOffset>04</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ClearPende_03</name>
					<description>Clear Pending for interrupt #03 (exception #19)</description>
					<bitOffset>03</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ClearPende_02</name>
					<description>Clear Pending for interrupt #02 (exception #18)</description>
					<bitOffset>02</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ClearPende_01</name>
					<description>Clear Pending for interrupt #01 (exception #17)</description>
					<bitOffset>01</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SetEnable_00</name>
					<description>Clear Pending for interrupt #00 (exception #16)</description>
					<bitOffset>00</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
			</fields>
		</register>
		<register>
			<name>NVIC_ICPR1</name>
			<description>NVIC Clear Pending Register 1 for interrupts 0 to 31</description>
			<addressOffset>0x284</addressOffset>
			<size>32</size>
			<access>read-write</access>
		    <fields>
				<field>
					<name>ClearPend_63</name>
					<description>Clear Pending for interrupt #63 (exception #79)</description>
					<bitOffset>31</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ClearPend_62</name>
					<description>Clear Pending for interrupt #62 (exception #78)</description>
					<bitOffset>30</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ClearPend_61</name>
					<description>Clear Pending for interrupt #61 (exception #77)</description>
					<bitOffset>29</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ClearPend_60</name>
					<description>Clear Pending for interrupt #60 (exception #76)</description>
					<bitOffset>28</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ClearPend_59</name>
					<description>Clear Pending for interrupt #59 (exception #75)</description>
					<bitOffset>27</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ClearPend_58</name>
					<description>Clear Pending for interrupt #58 (exception #74)</description>
					<bitOffset>26</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ClearPend_57</name>
					<description>Clear Pending for interrupt #57 (exception #73)</description>
					<bitOffset>25</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ClearPend_56</name>
					<description>Clear Pending for interrupt #56 (exception #72)</description>
					<bitOffset>24</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ClearPend_55</name>
					<description>Clear Pending for interrupt #55 (exception #71)</description>
					<bitOffset>23</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ClearPend_54</name>
					<description>Clear Pending for interrupt #54 (exception #70)</description>
					<bitOffset>22</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ClearPend_53</name>
					<description>Clear Pending for interrupt #53 (exception #69)</description>
					<bitOffset>21</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ClearPend_52</name>
					<description>Clear Pending for interrupt #52 (exception #68)</description>
					<bitOffset>20</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ClearPend_51</name>
					<description>Clear Pending for interrupt #51 (exception #67)</description>
					<bitOffset>19</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ClearPend_50</name>
					<description>Clear Pending for interrupt #50 (exception #66)</description>
					<bitOffset>18</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ClearPend_49</name>
					<description>Clear Pending for interrupt #49 (exception #65)</description>
					<bitOffset>17</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ClearPend_48</name>
					<description>Clear Pending for interrupt #48 (exception #64)</description>
					<bitOffset>16</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ClearPend_47</name>
					<description>Clear Pending for interrupt #47 (exception #63)</description>
					<bitOffset>15</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ClearPend_46</name>
					<description>Clear Pending for interrupt #46 (exception #62)</description>
					<bitOffset>14</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ClearPend_45</name>
					<description>Clear Pending for interrupt #45 (exception #61)</description>
					<bitOffset>13</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ClearPend_44</name>
					<description>Clear Pending for interrupt #44 (exception #60)</description>
					<bitOffset>12</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ClearPend_43</name>
					<description>Clear Pending for interrupt #43 (exception #59)</description>
					<bitOffset>11</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ClearPend_42</name>
					<description>Clear Pending for interrupt #42 (exception #58)</description>
					<bitOffset>10</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ClearPend_41</name>
					<description>Clear Pending for interrupt #41 (exception #57)</description>
					<bitOffset>09</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ClearPend_40</name>
					<description>Clear Pending for interrupt #40 (exception #56)</description>
					<bitOffset>08</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ClearPend_39</name>
					<description>Clear Pending for interrupt #39 (exception #55)</description>
					<bitOffset>07</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ClearPend_38</name>
					<description>Clear Pending for interrupt #38 (exception #54)</description>
					<bitOffset>06</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ClearPend_37</name>
					<description>Clear Pending for interrupt #37 (exception #53)</description>
					<bitOffset>05</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ClearPend_36</name>
					<description>Clear Pending for interrupt #36 (exception #52)</description>
					<bitOffset>04</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ClearPend_35</name>
					<description>Clear Pending for interrupt #35 (exception #51)</description>
					<bitOffset>03</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ClearPend_34</name>
					<description>Clear Pending for interrupt #34 (exception #50)</description>
					<bitOffset>02</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ClearPend_33</name>
					<description>Clear Pending for interrupt #33 (exception #49)</description>
					<bitOffset>01</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ClearPend_32</name>
					<description>Clear Pending for interrupt #32 (exception #48)</description>
					<bitOffset>00</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
			</fields>
		</register>
		<register>
			<name>NVIC_IABR0</name>
			<description>NVIC Active Status Register 0 for interrupts 0 to 31</description>
			<addressOffset>0x280</addressOffset>
			<size>32</size>
			<access>read-write</access>
		    <fields>
				<field>
					<name>ActiveStatus_31</name>
					<description>Active Status for interrupt #31 (exception #47)</description>
					<bitOffset>31</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ActiveStatus_30</name>
					<description>Active Status for interrupt #30 (exception #46)</description>
					<bitOffset>30</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ActiveStatus_29</name>
					<description>Active Status for interrupt #29 (exception #45)</description>
					<bitOffset>29</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ActiveStatus_28</name>
					<description>Active Status for interrupt #28 (exception #44)</description>
					<bitOffset>28</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ActiveStatus_27</name>
					<description>Active Status for interrupt #27 (exception #43)</description>
					<bitOffset>27</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ActiveStatus_26</name>
					<description>Active Status for interrupt #26 (exception #42)</description>
					<bitOffset>26</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ActiveStatus_25</name>
					<description>Active Status for interrupt #25 (exception #41)</description>
					<bitOffset>25</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ActiveStatus_24</name>
					<description>Active Status for interrupt #24 (exception #40)</description>
					<bitOffset>24</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ActiveStatus_23</name>
					<description>Active Status for interrupt #23 (exception #39)</description>
					<bitOffset>23</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ActiveStatus_22</name>
					<description>Active Status for interrupt #22 (exception #38)</description>
					<bitOffset>22</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ActiveStatus_21</name>
					<description>Active Status for interrupt #21 (exception #37)</description>
					<bitOffset>21</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ActiveStatus_20</name>
					<description>Active Status for interrupt #20 (exception #36)</description>
					<bitOffset>20</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ActiveStatus_19</name>
					<description>Active Status for interrupt #19 (exception #35)</description>
					<bitOffset>19</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ActiveStatus_18</name>
					<description>Active Status for interrupt #18 (exception #34)</description>
					<bitOffset>18</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ActiveStatus_17</name>
					<description>Active Status for interrupt #17 (exception #33)</description>
					<bitOffset>17</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ActiveStatus_16</name>
					<description>Active Status for interrupt #16 (exception #32)</description>
					<bitOffset>16</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ActiveStatus_15</name>
					<description>Active Status for interrupt #15 (exception #31)</description>
					<bitOffset>15</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ActiveStatus_14</name>
					<description>Active Status for interrupt #14 (exception #30)</description>
					<bitOffset>14</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ActiveStatus_13</name>
					<description>Active Status for interrupt #13 (exception #29)</description>
					<bitOffset>13</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ActiveStatus_12</name>
					<description>Active Status for interrupt #12 (exception #28)</description>
					<bitOffset>12</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ActiveStatus_11</name>
					<description>Active Status for interrupt #11 (exception #27)</description>
					<bitOffset>11</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ActiveStatus_10</name>
					<description>Active Status for interrupt #10 (exception #26)</description>
					<bitOffset>10</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ActiveStatus_09</name>
					<description>Active Status for interrupt #09 (exception #25)</description>
					<bitOffset>09</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ActiveStatus_08</name>
					<description>Active Status for interrupt #08 (exception #24)</description>
					<bitOffset>08</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ActiveStatus_07</name>
					<description>Active Status for interrupt #07 (exception #23)</description>
					<bitOffset>07</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ActiveStatus_06</name>
					<description>Active Status for interrupt #06 (exception #22)</description>
					<bitOffset>06</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ActiveStatus_05</name>
					<description>Active Status for interrupt #05 (exception #21)</description>
					<bitOffset>05</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ActiveStatus_04</name>
					<description>Active Status for interrupt #04 (exception #20)</description>
					<bitOffset>04</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ActiveStatus_03</name>
					<description>Active Status for interrupt #03 (exception #19)</description>
					<bitOffset>03</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ActiveStatus_02</name>
					<description>Active Status for interrupt #02 (exception #18)</description>
					<bitOffset>02</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ActiveStatus_01</name>
					<description>Active Status for interrupt #01 (exception #17)</description>
					<bitOffset>01</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ActiveStatus_00</name>
					<description>Active Status for interrupt #00 (exception #16)</description>
					<bitOffset>00</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
			</fields>
		</register>
