Manish-Subedi/embedded_Iot_project/ventilation_system/Debug/LPC15xx_peripheral.xml
		<register>
			<name>NVIC_IABR1</name>
			<description>NVIC Active Status Register 1 for interrupts 0 to 31</description>
			<addressOffset>0x284</addressOffset>
			<size>32</size>
			<access>read-write</access>
			<fields>
				<field>
					<name>ActiveStatus_63</name>
					<description>Active Status for interrupt #63 (exception #79)</description>
					<bitOffset>31</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ActiveStatus_62</name>
					<description>Active Status for interrupt #62 (exception #78)</description>
					<bitOffset>30</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ActiveStatus_61</name>
					<description>Active Status for interrupt #61 (exception #77)</description>
					<bitOffset>29</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ActiveStatus_60</name>
					<description>Active Status for interrupt #60 (exception #76)</description>
					<bitOffset>28</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ActiveStatus_59</name>
					<description>Active Status for interrupt #59 (exception #75)</description>
					<bitOffset>27</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ActiveStatus_58</name>
					<description>Active Status for interrupt #58 (exception #74)</description>
					<bitOffset>26</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ActiveStatus_57</name>
					<description>Active Status for interrupt #57 (exception #73)</description>
					<bitOffset>25</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ActiveStatus_56</name>
					<description>Active Status for interrupt #56 (exception #72)</description>
					<bitOffset>24</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ActiveStatus_55</name>
					<description>Active Status for interrupt #55 (exception #71)</description>
					<bitOffset>23</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ActiveStatus_54</name>
					<description>Active Status for interrupt #54 (exception #70)</description>
					<bitOffset>22</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ActiveStatus_53</name>
					<description>Active Status for interrupt #53 (exception #69)</description>
					<bitOffset>21</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ActiveStatus_52</name>
					<description>Active Status for interrupt #52 (exception #68)</description>
					<bitOffset>20</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ActiveStatus_51</name>
					<description>Active Status for interrupt #51 (exception #67)</description>
					<bitOffset>19</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ActiveStatus_50</name>
					<description>Active Status for interrupt #50 (exception #66)</description>
					<bitOffset>18</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ActiveStatus_49</name>
					<description>Active Status for interrupt #49 (exception #65)</description>
					<bitOffset>17</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ActiveStatus_48</name>
					<description>Active Status for interrupt #48 (exception #64)</description>
					<bitOffset>16</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ActiveStatus_47</name>
					<description>Active Status for interrupt #47 (exception #63)</description>
					<bitOffset>15</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ActiveStatus_46</name>
					<description>Active Status for interrupt #46 (exception #62)</description>
					<bitOffset>14</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ActiveStatus_45</name>
					<description>Active Status for interrupt #45 (exception #61)</description>
					<bitOffset>13</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ActiveStatus_44</name>
					<description>Active Status for interrupt #44 (exception #60)</description>
					<bitOffset>12</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ActiveStatus_43</name>
					<description>Active Status for interrupt #43 (exception #59)</description>
					<bitOffset>11</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ActiveStatus_42</name>
					<description>Active Status for interrupt #42 (exception #58)</description>
					<bitOffset>10</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ActiveStatus_41</name>
					<description>Active Status for interrupt #41 (exception #57)</description>
					<bitOffset>09</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ActiveStatus_40</name>
					<description>Active Status for interrupt #40 (exception #56)</description>
					<bitOffset>08</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ActiveStatus_39</name>
					<description>Active Status for interrupt #39 (exception #55)</description>
					<bitOffset>07</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ActiveStatus_38</name>
					<description>Active Status for interrupt #38 (exception #54)</description>
					<bitOffset>06</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ActiveStatus_37</name>
					<description>Active Status for interrupt #37 (exception #53)</description>
					<bitOffset>05</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ActiveStatus_36</name>
					<description>Active Status for interrupt #36 (exception #52)</description>
					<bitOffset>04</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ActiveStatus_35</name>
					<description>Active Status for interrupt #35 (exception #51)</description>
					<bitOffset>03</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ActiveStatus_34</name>
					<description>Active Status for interrupt #34 (exception #50)</description>
					<bitOffset>02</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ActiveStatus_33</name>
					<description>Active Status for interrupt #33 (exception #49)</description>
					<bitOffset>01</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ActiveStatus_32</name>
					<description>Active Status for interrupt #32 (exception #48)</description>
					<bitOffset>00</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
			</fields>
		</register>
		<register>
			<name>NVIC_IPR0</name>
			<description>NVIC Priority level for interrupt 0 (exception #16)</description>
			<addressOffset>0x400</addressOffset>
			<size>8</size>
			<access>read-write</access>
		</register>
		<register>
			<name>NVIC_IPR1</name>
			<description>NVIC Priority level for interrupt 1 (exception #17)</description>
			<addressOffset>0x401</addressOffset>
			<size>8</size>
			<access>read-write</access>
		</register>
		<register>
			<name>NVIC_IPR2</name>
			<description>NVIC Priority level for interrupt 2 (exception #18)</description>
			<addressOffset>0x402</addressOffset>
			<size>8</size>
			<access>read-write</access>
		</register>
		<register>
			<name>NVIC_IPR3</name>
			<description>NVIC Priority level for interrupt 3 (exception #19)</description>
			<addressOffset>0x403</addressOffset>
			<size>8</size>
			<access>read-write</access>
		</register>
		<register>
			<name>NVIC_IPR4</name>
			<description>NVIC Priority level for interrupt 4 (exception #20)</description>
			<addressOffset>0x404</addressOffset>
			<size>8</size>
			<access>read-write</access>
		</register>
		<register>
			<name>NVIC_IPR5</name>
			<description>NVIC Priority level for interrupt 5 (exception #21)</description>
			<addressOffset>0x405</addressOffset>
			<size>8</size>
			<access>read-write</access>
		</register>
		<register>
			<name>NVIC_IPR6</name>
			<description>NVIC Priority level for interrupt 6 (exception #22)</description>
			<addressOffset>0x406</addressOffset>
			<size>8</size>
			<access>read-write</access>
		</register>
		<register>
			<name>NVIC_IPR7</name>
			<description>NVIC Priority level for interrupt 7 (exception #23)</description>
			<addressOffset>0x407</addressOffset>
			<size>8</size>
			<access>read-write</access>
		</register>
		<register>
			<name>NVIC_IPR8</name>
			<description>NVIC Priority level for interrupt 8 (exception #24)</description>
			<addressOffset>0x408</addressOffset>
			<size>8</size>
			<access>read-write</access>
		</register>
		<register>
			<name>NVIC_IPR9</name>
			<description>NVIC Priority level for interrupt 9 (exception #25)</description>
			<addressOffset>0x409</addressOffset>
			<size>8</size>
			<access>read-write</access>
		</register>
		<register>
			<name>NVIC_IPR10</name>
			<description>NVIC Priority level for interrupt 10 (exception #26)</description>
			<addressOffset>0x40A</addressOffset>
			<size>8</size>
			<access>read-write</access>
		</register>
		<register>
			<name>NVIC_IPR11</name>
			<description>NVIC Priority level for interrupt 11 (exception #27)</description>
			<addressOffset>0x40B</addressOffset>
			<size>8</size>
			<access>read-write</access>
		</register>
		<register>
			<name>NVIC_IPR12</name>
			<description>NVIC Priority level for interrupt 12 (exception #28)</description>
			<addressOffset>0x40C</addressOffset>
			<size>8</size>
			<access>read-write</access>
		</register>
		<register>
			<name>NVIC_IPR13</name>
			<description>NVIC Priority level for interrupt 13 (exception #29)</description>
			<addressOffset>0x40D</addressOffset>
			<size>8</size>
			<access>read-write</access>
		</register>
		<register>
			<name>NVIC_IPR14</name>
			<description>NNVIC Priority level for interrupt 14 (exception #30)</description>
			<addressOffset>0x40E</addressOffset>
			<size>8</size>
			<access>read-write</access>
		</register>
		<register>
			<name>NVIC_IPR15</name>
			<description>NVIC Priority level for interrupt 15 (exception #31)</description>
			<addressOffset>0x40F</addressOffset>
			<size>8</size>
			<access>read-write</access>
		</register>
		<register>
			<name>NVIC_IPR16</name>
			<description>NVIC Priority level for interrupt 16 (exception #32)</description>
			<addressOffset>0x410</addressOffset>
			<size>8</size>
			<access>read-write</access>
		</register>
		<register>
			<name>NVIC_IPR17</name>
			<description>NVIC Priority level for interrupt 17 (exception #33)</description>
			<addressOffset>0x411</addressOffset>
			<size>8</size>
			<access>read-write</access>
		</register>
		<register>
			<name>NVIC_IPR18</name>
			<description>NVIC Priority level for interrupt 18 (exception #34)</description>
			<addressOffset>0x412</addressOffset>
			<size>8</size>
			<access>read-write</access>
		</register>
		<register>
			<name>NVIC_IPR19</name>
			<description>NVIC Priority level for interrupt 19 (exception #35)</description>
			<addressOffset>0x413</addressOffset>
			<size>8</size>
			<access>read-write</access>
		</register>
		<register>
			<name>NVIC_IPR20</name>
			<description>NVIC Priority level for interrupt 20 (exception #36)</description>
			<addressOffset>0x414</addressOffset>
			<size>8</size>
			<access>read-write</access>
		</register>
		<register>
			<name>NVIC_IPR21</name>
			<description>NVIC Priority level for interrupt 21 (exception #37)</description>
			<addressOffset>0x415</addressOffset>
			<size>8</size>
			<access>read-write</access>
		</register>
		<register>
			<name>NVIC_IPR22</name>
			<description>NVIC Priority level for interrupt 22 (exception #38)</description>
			<addressOffset>0x416</addressOffset>
			<size>8</size>
			<access>read-write</access>
		</register>
		<register>
			<name>NVIC_IPR23</name>
			<description>NVIC Priority level for interrupt 23 (exception #39)</description>
			<addressOffset>0x417</addressOffset>
			<size>8</size>
			<access>read-write</access>
		</register>
		<register>
			<name>NVIC_IPR24</name>
			<description>NVIC Priority level for interrupt 24 (exception #40)</description>
			<addressOffset>0x418</addressOffset>
			<size>8</size>
			<access>read-write</access>
		</register>
		<register>
			<name>NVIC_IPR25</name>
			<description>NVIC Priority level for interrupt 25 (exception #41)</description>
			<addressOffset>0x419</addressOffset>
			<size>8</size>
			<access>read-write</access>
		</register>
		<register>
			<name>NVIC_IPR26</name>
			<description>NVIC Priority level for interrupt 26 (exception #42)</description>
			<addressOffset>0x41A</addressOffset>
			<size>8</size>
			<access>read-write</access>
		</register>
		<register>
			<name>NVIC_IPR27</name>
			<description>NVIC Priority level for interrupt 27 (exception #43)</description>
			<addressOffset>0x41B</addressOffset>
			<size>8</size>
			<access>read-write</access>
		</register>
		<register>
			<name>NVIC_IPR28</name>
			<description>NVIC Priority level for interrupt 28 (exception #44)</description>
			<addressOffset>0x41C</addressOffset>
			<size>8</size>
			<access>read-write</access>
		</register>
		<register>
			<name>NVIC_IPR29</name>
			<description>NVIC Priority level for interrupt 29 (exception #45)</description>
			<addressOffset>0x41D</addressOffset>
			<size>8</size>
			<access>read-write</access>
		</register>
		<register>
			<name>NVIC_IPR30</name>
			<description>NVIC Priority level for interrupt 30 (exception #46)</description>
			<addressOffset>0x41E</addressOffset>
			<size>8</size>
			<access>read-write</access>
		</register>
		<register>
			<name>NVIC_IPR31</name>
			<description>NVIC Priority level for interrupt 31 (exception #47)</description>
			<addressOffset>0x41F</addressOffset>
			<size>8</size>
			<access>read-write</access>
		</register>
		<register>
			<name>NVIC_IPR32</name>
			<description>NVIC Priority level for interrupt 32 (exception #48)</description>
			<addressOffset>0x420</addressOffset>
			<size>8</size>
			<access>read-write</access>
		</register>
		<register>
			<name>NVIC_IPR33</name>
			<description>NVIC Priority level for interrupt 33 (exception #49)</description>
			<addressOffset>0x421</addressOffset>
			<size>8</size>
			<access>read-write</access>
		</register>
		<register>
			<name>NVIC_IPR34</name>
			<description>NVIC Priority level for interrupt 34 (exception #50)</description>
			<addressOffset>0x422</addressOffset>
			<size>8</size>
			<access>read-write</access>
		</register>
		<register>
			<name>NVIC_IPR35</name>
			<description>NVIC Priority level for interrupt 35 (exception #51)</description>
			<addressOffset>0x423</addressOffset>
			<size>8</size>
			<access>read-write</access>
		</register>
		<register>
			<name>NVIC_IPR36</name>
			<description>NVIC Priority level for interrupt 36 (exception #52)</description>
			<addressOffset>0x424</addressOffset>
			<size>8</size>
			<access>read-write</access>
		</register>
		<register>
			<name>NVIC_IPR37</name>
			<description>NVIC Priority level for interrupt 37 (exception #53)</description>
			<addressOffset>0x425</addressOffset>
			<size>8</size>
			<access>read-write</access>
		</register>
		<register>
			<name>NVIC_IPR38</name>
			<description>NVIC Priority level for interrupt 38 (exception #54)</description>
			<addressOffset>0x426</addressOffset>
			<size>8</size>
			<access>read-write</access>
		</register>
		<register>
			<name>NVIC_IPR39</name>
			<description>NVIC Priority level for interrupt 39 (exception #55)</description>
			<addressOffset>0x427</addressOffset>
			<size>8</size>
			<access>read-write</access>
		</register>
		<register>
			<name>NVIC_IPR40</name>
			<description>NVIC Priority level for interrupt 40 (exception #56)</description>
			<addressOffset>0x428</addressOffset>
			<size>8</size>
			<access>read-write</access>
		</register>
		<register>
			<name>NVIC_IPR41</name>
			<description>NVIC Priority level for interrupt 41 (exception #57)</description>
			<addressOffset>0x429</addressOffset>
			<size>8</size>
			<access>read-write</access>
		</register>
		<register>
			<name>NVIC_IPR42</name>
			<description>NVIC Priority level for interrupt 42 (exception #58)</description>
			<addressOffset>0x42A</addressOffset>
			<size>8</size>
			<access>read-write</access>
		</register>
		<register>
			<name>NVIC_IPR43</name>
			<description>NVIC Priority level for interrupt 43 (exception #59)</description>
			<addressOffset>0x42B</addressOffset>
			<size>8</size>
			<access>read-write</access>
		</register>
		<register>
			<name>NVIC_IPR44</name>
			<description>NVIC Priority level for interrupt 44 (exception #60)</description>
			<addressOffset>0x42C</addressOffset>
			<size>8</size>
			<access>read-write</access>
		</register>
		<register>
			<name>NVIC_IPR45</name>
			<description>NVIC Priority level for interrupt 45 (exception #61)</description>
			<addressOffset>0x42D</addressOffset>
			<size>8</size>
			<access>read-write</access>
		</register>
		<register>
			<name>NVIC_IPR46</name>
			<description>NVIC Priority level for interrupt 46 (exception #62)</description>
			<addressOffset>0x42E</addressOffset>
			<size>8</size>
			<access>read-write</access>
		</register>
		<register>
			<name>NVIC_IPR47</name>
			<description>NVIC Priority level for interrupt 47 (exception #63)</description>
			<addressOffset>0x42F</addressOffset>
			<size>8</size>
			<access>read-write</access>
		</register>
		<register>
			<name>NVIC_IPR48</name>
			<description>NVIC Priority level for interrupt 48 (exception #64)</description>
			<addressOffset>0x430</addressOffset>
			<size>8</size>
			<access>read-write</access>
		</register>
		<register>
			<name>NVIC_IPR49</name>
			<description>NVIC Priority level for interrupt 49 (exception #65)</description>
			<addressOffset>0x431</addressOffset>
			<size>8</size>
			<access>read-write</access>
		</register>
		<register>
			<name>NVIC_IPR50</name>
			<description>NVIC Priority level for interrupt 50 (exception #66)</description>
			<addressOffset>0x48</addressOffset>
			<size>8</size>
			<access>read-write</access>
		</register>
		<register>
			<name>NVIC_IPR51</name>
			<description>NVIC Priority level for interrupt 51 (exception #67)</description>
			<addressOffset>0x433</addressOffset>
			<size>8</size>
			<access>read-write</access>
		</register>
		<register>
			<name>NVIC_IPR52</name>
			<description>NVIC Priority level for interrupt 52 (exception #68)</description>
			<addressOffset>0x434</addressOffset>
			<size>8</size>
			<access>read-write</access>
		</register>
		<register>
			<name>NVIC_IPR53</name>
			<description>NVIC Priority level for interrupt 53 (exception #69)</description>
			<addressOffset>0x435</addressOffset>
			<size>8</size>
			<access>read-write</access>
		</register>
		<register>
			<name>NVIC_IPR54</name>
			<description>NVIC Priority level for interrupt 54 (exception #70)</description>
			<addressOffset>0x436</addressOffset>
			<size>8</size>
			<access>read-write</access>
		</register>
		<register>
			<name>NVIC_IPR55</name>
			<description>NVIC Priority level for interrupt 55 (exception #71)</description>
			<addressOffset>0x437</addressOffset>
			<size>8</size>
			<access>read-write</access>
		</register>
		<register>
			<name>NVIC_IPR56</name>
			<description>NVIC Priority level for interrupt 56 (exception #72)</description>
			<addressOffset>0x438</addressOffset>
			<size>8</size>
			<access>read-write</access>
		</register>
		<register>
			<name>NVIC_IPR57</name>
			<description>NVIC Priority level for interrupt 57 (exception #73)</description>
			<addressOffset>0x439</addressOffset>
			<size>8</size>
			<access>read-write</access>
		</register>
		<register>
			<name>NVIC_IPR58</name>
			<description>NVIC Priority level for interrupt 58 (exception #74)</description>
			<addressOffset>0x43A</addressOffset>
			<size>8</size>
			<access>read-write</access>
		</register>
		<register>
			<name>NVIC_IPR59</name>
			<description>NVIC Priority level for interrupt 59 (exception #75)</description>
			<addressOffset>0x43B</addressOffset>
			<size>8</size>
			<access>read-write</access>
		</register>
		<register>
			<name>NVIC_IPR60</name>
			<description>NVIC Priority level for interrupt 60 (exception #76)</description>
			<addressOffset>0x43C</addressOffset>
			<size>8</size>
			<access>read-write</access>
		</register>
		<register>
			<name>NVIC_IPR61</name>
			<description>NVIC Priority level for interrupt 61 (exception #77)</description>
			<addressOffset>0x43D</addressOffset>
			<size>8</size>
			<access>read-write</access>
		</register>
		<register>
			<name>NVIC_IP62</name>
			<description>NVIC Priority level for interrupt 62 (exception #78)</description>
			<addressOffset>0x43E</addressOffset>
			<size>8</size>
			<access>read-write</access>
		</register>
		<register>
			<name>NVIC_IPR63</name>
			<description>NVIC Priority level for interrupt 63 (exception #79)</description>
			<addressOffset>0x43F</addressOffset>
			<size>8</size>
			<access>read-write</access>
		</register>
		<register>
			<name>SCB_CPUID</name>
			<description>CPU ID Base Register</description>
			<addressOffset>0xD00</addressOffset>
			<size>32</size>
			<access>read-only</access>
			<fields>
				<field>
					<name>IMPLEMENTER</name>
					<description>Implementer code</description>
					<bitOffset>24</bitOffset>
					<bitWidth>8</bitWidth>
					<access>read-only</access>
				</field>
				<field>
					<name>VARIANT</name>
					<description>Variant number</description>
					<bitOffset>20</bitOffset>
					<bitWidth>4</bitWidth>
					<access>read-only</access>
				</field>
				<field>
					<name>ARCHITECTURE</name>
					<description>Reads as 0xC for ARMv6-M parts</description>
					<bitOffset>16</bitOffset>
					<bitWidth>4</bitWidth>
					<access>read-only</access>
				</field>
				<field>
					<name>PARTNO</name>
					<description>Number of processor within family</description>
					<bitOffset>4</bitOffset>
					<bitWidth>12</bitWidth>
					<access>read-only</access>
				</field>
				<field>
					<name>REVISION</name>
					<description>Revision number</description>
					<bitOffset>0</bitOffset>
					<bitWidth>4</bitWidth>
					<access>read-only</access>
				</field>
			</fields>
		</register>
