Manish-Subedi/embedded_Iot_project/ventilation_system/Debug/LPC15xx_peripheral.xml
		<register>
			<name>SCB_ICSR</name>
			<description>Interrupt Control State Register</description>
			<addressOffset>0xd04</addressOffset>
			<size>32</size>
			<access>read-write</access>
			<fields>
				<field>
					<name>NMIPENDSET</name>
					<description>Set pending NMI bit</description>
					<bitOffset>31</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>PENDSVSET</name>
					<description>Set pending pendSV bit</description>
					<bitOffset>28</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>PENDSVCLR</name>
					<description>Clear pending pendSV bit</description>
					<bitOffset>27</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>PENDSTSET</name>
					<description>Set a pending SysTick bit</description>
					<bitOffset>26</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>PENDSTCLR</name>
					<description>Clear pending SysTick bit</description>
					<bitOffset>25</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ISRPREEMPT</name>
					<description>Pending interrupt on coming out of debug</description>
					<bitOffset>23</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ISRPENDING</name>
					<description>Interrupt pending flag (excluding NMI and Fault)</description>
					<bitOffset>22</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>VECTPENDING</name>
					<description>Pending ISR interrupt number</description>
					<bitOffset>12</bitOffset>
					<bitWidth>10</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>RETTOBASE</name>
					<description>Set when no active exceptions</description>
					<bitOffset>11</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>VECTACTIVE</name>
					<description>Active ISR interrupt number</description>
					<bitOffset>0</bitOffset>
					<bitWidth>9</bitWidth>
					<access>read-write</access>
				</field>
			</fields>
		</register>
		<register>
			<name>SCB_VTOR</name>
			<description>Vector Table Offset Register</description>
			<addressOffset>0xd08</addressOffset>
			<size>32</size>
			<access>read-write</access>

			<fields>
				<field>
					<name>TBLBASE</name>
					<description>Vector table is in CODE(0) or SRAM(1)</description>
					<bitOffset>29</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>TBLOFF</name>
					<description>Vector table base offset field from bottom</description>
					<bitOffset>7</bitOffset>
					<bitWidth>22</bitWidth>
					<access>read-write</access>
				</field>
			</fields>
		</register>
		<register>
			<name>SCB_AIRCR</name>
			<description>Application Interrupt and Reset Control Register</description>
			<addressOffset>0xd0c</addressOffset>
			<size>32</size>
			<access>read-write</access>
		    <fields>
				<field>
					<name>VECTKEY</name>
					<description>Register Key</description>
					<bitOffset>16</bitOffset>
					<bitWidth>16</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ENDIANESS</name>
					<description>Data endianess bit</description>
					<bitOffset>15</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>PRIGROUP</name>
					<description>Interrupt priority grouping field</description>
					<bitOffset>8</bitOffset>
					<bitWidth>3</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SYSRESETREQ</name>
					<description>Force an outside of core system reset</description>
					<bitOffset>2</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>VECTCLRACTIVE</name>
					<description>Clear active vector bit</description>
					<bitOffset>1</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>VECTRESET</name>
					<description>System Reset bit</description>
					<bitOffset>0</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
			</fields>
		</register>
		<register>
			<name>SCB_SCR</name>
			<description>System Control Register</description>
			<addressOffset>0xd10</addressOffset>
			<size>32</size>
			<access>read-write</access>
		    <fields>
				<field>
					<name>SEVONPEND</name>
					<description>Cause WFE to wake on moving from inactive to pended</description>
					<bitOffset>4</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SLEEPDEEP</name>
					<description>Sleep deep bit</description>
					<bitOffset>2</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SLEEPONEXIT</name>
					<description>Sleep when returning from Handler to Thread</description>
					<bitOffset>1</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
			</fields>
		</register>
		<register>
			<name>SCB_CCR</name>
			<description>Configuration Control Register</description>
			<addressOffset>0xd14</addressOffset>
			<size>32</size>
			<access>read-write</access>
			<fields>
				<field>
					<name>STKALIGN</name>
					<description>If set then stack is aligned to 8 on exception entry</description>
					<bitOffset>9</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>BFHFNMIGN</name>
					<description>This causes Hard Fault NMI and FAULTMASK to ignore Data Bus Faults</description>
					<bitOffset>8</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>DIV_0_TRP</name>
					<description>Trap on divide by zero</description>
					<bitOffset>4</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>UNALIGN_TRAP</name>
					<description>Trap for unaligned access</description>
					<bitOffset>3</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>USERSETMPEND</name>
					<description>Enables user code to trigger a Main exception</description>
					<bitOffset>1</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>NONEBASETHRDENA</name>
					<description>Enable Thread mode to be entered from any level</description>
					<bitOffset>0</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
			</fields>
		</register>
		<register>
			<name>SCB_SHP0</name>
			<description>ystem Handler Priority Register 0 (Mem Manage)</description>
			<addressOffset>0xD18</addressOffset>
			<size>8</size>
			<access>read-write</access>
		</register>
		<register>
			<name>SCB_SHP1</name>
			<description>System Handler Priority Register 1 (Bus Fault)</description>
			<addressOffset>0xD19</addressOffset>
			<size>8</size>
			<access>read-write</access>
		</register>
		<register>
			<name>SCB_SHP2</name>
			<description>System Handler Priority Register 2 (Usage Fault)</description>
			<addressOffset>0xD1A</addressOffset>
			<size>8</size>
			<access>read-write</access>
		</register>
		<register>
			<name>SCB_SHP7</name>
			<description>System Handler Priority Register 7 (SVC)</description>
			<addressOffset>0xD1F</addressOffset>
			<size>8</size>
			<access>read-write</access>
		</register>
		<register>
			<name>SCB_SHP8</name>
			<description>System Handler Priority Register 8 (Debug Monitor)</description>
			<addressOffset>0xD20</addressOffset>
			<size>8</size>
			<access>read-write</access>
		</register>
		<register>
			<name>SCB_SHP10</name>
			<description>System Handler Priority Register 10 (PendSV)</description>
			<addressOffset>0xD22</addressOffset>
			<size>8</size>
			<access>read-write</access>
		</register>
		<register>
			<name>SCB_SHP11</name>
			<description>System Handler Priority Register 11 (SysTick)</description>
			<addressOffset>0xD23</addressOffset>
			<size>8</size>
			<access>read-write</access>
		</register>
		<register>
			<name>SCB_SHCSR</name>
			<description>System Handler Control and State Register</description>
			<addressOffset>0xd24</addressOffset>
			<size>32</size>
			<access>read-write</access>
			<fields>
				<field>
					<name>USGFAULTENA</name>
					<description>Useage fault enable</description>
					<bitOffset>18</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>BUSFAULTENA</name>
					<description>Bus fault enable</description>
					<bitOffset>17</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>MEMFAULTENA</name>
					<description>Memory fault enable</description>
					<bitOffset>16</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SVCALLPENDED</name>
					<description>1 if SVCall pended</description>
					<bitOffset>15</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>BUSFAULTPENDED</name>
					<description>1 if Bus Fault is pended</description>
					<bitOffset>14</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>MEMFAULTPENDED</name>
					<description>1 if Memory management fault is pended</description>
					<bitOffset>13</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>USGFAULTPENDED</name>
					<description>1 if Usage fault is pended</description>
					<bitOffset>12</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SYSTICKACT</name>
					<description>1 if SysTick is active</description>
					<bitOffset>11</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>PENDSVACT</name>
					<description>1 if PendSV is active</description>
					<bitOffset>10</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>MONITORACT</name>
					<description>1 if monitor is active</description>
					<bitOffset>8</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SVCALLACT</name>
					<description>1 if SVCall is active</description>
					<bitOffset>7</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>USGFAULTACT</name>
					<description>1 if Usage fault is active</description>
					<bitOffset>3</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>BUSFAULTACT</name>
					<description>1 if Bus Fault is active</description>
					<bitOffset>1</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>MEMFAULTACT</name>
					<description>1 if Memory management fault is active</description>
					<bitOffset>0</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
			</fields>
		</register>
		<register>
			<name>SCB_CFSR</name>
			<description>Configurable Fault Status Register</description>
			<addressOffset>0xd28</addressOffset>
			<size>32</size>
			<access>read-write</access>
			<fields>
				<field>
					<name>MMARVALID</name>
					<description>Memory manage address register valid</description>
					<bitOffset>7</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>MLSPERR</name>
					<description>Floating point lazy stacking error</description>
					<bitOffset>5</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>MSTKERR</name>
					<description>Stacking from exception has caused access violation</description>
					<bitOffset>4</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>MUNSTKERR</name>
					<description>Unstacking from exception has caused access violation</description>
					<bitOffset>3</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>DACCVIOL</name>
					<description>Data access violation flag.</description>
					<bitOffset>1</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>IACCVIOL</name>
					<description>Instruction access violation flag.</description>
					<bitOffset>0</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>BFARVALID</name>
					<description>Bus fault address register valid</description>
					<bitOffset>15</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>LSPERR</name>
					<description>Floating point lazy stacking error</description>
					<bitOffset>13</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>STKERR</name>
					<description>Stacking from exception has caused bus fault</description>
					<bitOffset>12</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>UNSTKERR</name>
					<description>Unstacking from exception has caused bus fault</description>
					<bitOffset>11</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>IMPRECISEERR</name>
					<description>Imprecise data bus error</description>
					<bitOffset>10</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>PRECISEERR</name>
					<description>Precise data bus error</description>
					<bitOffset>9</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>IBUSERR</name>
					<description>1Instruction bus error</description>
					<bitOffset>9</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>DIVBYZERO</name>
					<description>Divide by zero</description>
					<bitOffset>25</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>UNALIGNED</name>
					<description>Unaligned trap</description>
					<bitOffset>24</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>NOCP</name>
					<description>Attempt to use coprocessor instruction</description>
					<bitOffset>19</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>INVPC</name>
					<description>Invalid PC was attempted to load into PC</description>
					<bitOffset>18</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>INVSTATE</name>
					<description>Invalid combination of EPSR and instruction</description>
					<bitOffset>17</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>UNDEFINSTR</name>
					<description>Undefined instruction</description>
					<bitOffset>16</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
			</fields>
		</register>
		<register>
			<name>SCB_HFSR</name>
			<description>Hard Fault Status Register</description>
			<addressOffset>0xd2c</addressOffset>
			<size>32</size>
			<access>read-write</access>
			<fields>
				<field>
					<name>DEBUGEVT</name>
					<description>Fault related to debug</description>
					<bitOffset>31</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>FORCED</name>
					<description>Hard fault activated</description>
					<bitOffset>30</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>VECTTBL</name>
					<description>Vector table read has caused an fault</description>
					<bitOffset>1</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
			</fields>
		</register>
		<register>
			<name>SCB_DFSR</name>
			<description>Debug Fault Status Register</description>
			<addressOffset>0xd30</addressOffset>
			<size>32</size>
			<access>read-write</access>
			<fields>
				<field>
					<name>EXTERNAL</name>
					<description>External debug request flag</description>
					<bitOffset>4</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>VCATCH</name>
					<description>External debug request flag</description>
					<bitOffset>3</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>DWTTRAP</name>
					<description>Data watchpoint and Trace flag</description>
					<bitOffset>2</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>BKPT</name>
					<description>Breakpoint flag</description>
					<bitOffset>1</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>HALTED</name>
					<description>Halt request flag</description>
					<bitOffset>0</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
			</fields>
		</register>
		<register>
			<name>SCB_MMFAR</name>
			<description>Memory Management Fault Address Register</description>
			<addressOffset>0xd34</addressOffset>
			<size>32</size>
			<access>read-write</access>
		</register>
		<register>
			<name>SCB_BFAR</name>
			<description>Bus Fault Address Register</description>
			<addressOffset>0xd38</addressOffset>
			<size>32</size>
			<access>read-write</access>
		</register>
		<register>
			<name>SCB_AFSR</name>
			<description>Auxiliary Fault Status Register</description>
			<addressOffset>0xd3c</addressOffset>
			<size>32</size>
			<access>read-write</access>
		</register>
		<register>
			<name>NVIC_STIR</name>
			<description>Software Trigger Interrupt Register</description>
			<addressOffset>0xf00</addressOffset>
			<size>32</size>
			<access>read-write</access>
		</register>
