Manish-Subedi/embedded_Iot_project/ventilation_system/Debug/LPC15xx_peripheral.xml
	</registers>
</peripheral>
<peripheral>
	<name>ITM</name>
	<description>Instrumentation Trace Macrocell</description>
	<baseAddress>0xE0000000</baseAddress>
	<registers>
		<register>
			<name>ITM_SP0</name>
			<description>ITM Stimulus Port 0</description>
			<addressOffset>0x000</addressOffset>
			<size>32</size>
			<access>read-write</access>
		</register>
		<register>
			<name>ITM_SP1</name>
			<description>ITM Stimulus Port 1</description>
			<addressOffset>0x004</addressOffset>
			<size>32</size>
			<access>read-write</access>
		</register>
		<register>
			<name>ITM_SP2</name>
			<description>ITM Stimulus Port 2</description>
			<addressOffset>0x008</addressOffset>
			<size>32</size>
			<access>read-write</access>
		</register>
		<register>
			<name>ITM_SP3</name>
			<description>ITM Stimulus Port 3</description>
			<addressOffset>0x00C</addressOffset>
			<size>32</size>
			<access>read-write</access>
		</register>
		<register>
			<name>ITM_SP4</name>
			<description>ITM Stimulus Port 4</description>
			<addressOffset>0x020</addressOffset>
			<size>32</size>
			<access>read-write</access>
		</register>
		<register>
			<name>ITM_SP5</name>
			<description>ITM Stimulus Port 5</description>
			<addressOffset>0x024</addressOffset>
			<size>32</size>
			<access>read-write</access>
		</register>
		<register>
			<name>ITM_SP6</name>
			<description>ITM Stimulus Port 6</description>
			<addressOffset>0x028</addressOffset>
			<size>32</size>
			<access>read-write</access>
		</register>
		<register>
			<name>ITM_SP7</name>
			<description>ITM Stimulus Port 7</description>
			<addressOffset>0x02C</addressOffset>
			<size>32</size>
			<access>read-write</access>
		</register>
		<register>
			<name>ITM_SP8</name>
			<description>ITM Stimulus Port 8</description>
			<addressOffset>0x030</addressOffset>
			<size>32</size>
			<access>read-write</access>
		</register>
		<register>
			<name>ITM_SP9</name>
			<description>ITM Stimulus Port 9</description>
			<addressOffset>0x034</addressOffset>
			<size>32</size>
			<access>read-write</access>
		</register>
		<register>
			<name>ITM_SP10</name>
			<description>ITM Stimulus Port 10</description>
			<addressOffset>0x038</addressOffset>
			<size>32</size>
			<access>read-write</access>
		</register>
		<register>
			<name>ITM_SP11</name>
			<description>ITM Stimulus Port 11</description>
			<addressOffset>0x03C</addressOffset>
			<size>32</size>
			<access>read-write</access>
		</register>
		<register>
			<name>ITM_SP12</name>
			<description>ITM Stimulus Port 12</description>
			<addressOffset>0x040</addressOffset>
			<size>32</size>
			<access>read-write</access>
		</register>
		<register>
			<name>ITM_SP13</name>
			<description>ITM Stimulus Port 13</description>
			<addressOffset>0x044</addressOffset>
			<size>32</size>
			<access>read-write</access>
		</register>
		<register>
			<name>ITM_SP14</name>
			<description>ITM Stimulus Port 14</description>
			<addressOffset>0x048</addressOffset>
			<size>32</size>
			<access>read-write</access>
		</register>
		<register>
			<name>ITM_SP15</name>
			<description>ITM Stimulus Port 15</description>
			<addressOffset>0x04C</addressOffset>
			<size>32</size>
			<access>read-write</access>
		</register>
		<register>
			<name>ITM_SP16</name>
			<description>ITM Stimulus Port 16</description>
			<addressOffset>0x000</addressOffset>
			<size>32</size>
			<access>read-write</access>
		</register>
		<register>
			<name>ITM_SP17</name>
			<description>ITM Stimulus Port 17</description>
			<addressOffset>0x004</addressOffset>
			<size>32</size>
			<access>read-write</access>
		</register>
		<register>
			<name>ITM_SP18</name>
			<description>ITM Stimulus Port 18</description>
			<addressOffset>0x008</addressOffset>
			<size>32</size>
			<access>read-write</access>
		</register>
		<register>
			<name>ITM_SP19</name>
			<description>ITM Stimulus Port 19</description>
			<addressOffset>0x00C</addressOffset>
			<size>32</size>
			<access>read-write</access>
		</register>
		<register>
			<name>ITM_SP20</name>
			<description>ITM Stimulus Port 20</description>
			<addressOffset>0x020</addressOffset>
			<size>32</size>
			<access>read-write</access>
		</register>
		<register>
			<name>ITM_SP21</name>
			<description>ITM Stimulus Port 21</description>
			<addressOffset>0x024</addressOffset>
			<size>32</size>
			<access>read-write</access>
		</register>
		<register>
			<name>ITM_SP22</name>
			<description>ITM Stimulus Port 22</description>
			<addressOffset>0x028</addressOffset>
			<size>32</size>
			<access>read-write</access>
		</register>
		<register>
			<name>ITM_SP23</name>
			<description>ITM Stimulus Port 23</description>
			<addressOffset>0x02C</addressOffset>
			<size>32</size>
			<access>read-write</access>
		</register>
		<register>
			<name>ITM_SP24</name>
			<description>ITM Stimulus Port 24</description>
			<addressOffset>0x030</addressOffset>
			<size>32</size>
			<access>read-write</access>
		</register>
		<register>
			<name>ITM_SP25</name>
			<description>ITM Stimulus Port 25</description>
			<addressOffset>0x034</addressOffset>
			<size>32</size>
			<access>read-write</access>
		</register>
		<register>
			<name>ITM_SP26</name>
			<description>ITM Stimulus Port 26</description>
			<addressOffset>0x038</addressOffset>
			<size>32</size>
			<access>read-write</access>
		</register>
		<register>
			<name>ITM_SP27</name>
			<description>ITM Stimulus Port 27</description>
			<addressOffset>0x03C</addressOffset>
			<size>32</size>
			<access>read-write</access>
		</register>
		<register>
			<name>ITM_SP28</name>
			<description>ITM Stimulus Port 28</description>
			<addressOffset>0x040</addressOffset>
			<size>32</size>
			<access>read-write</access>
		</register>
		<register>
			<name>ITM_SP29</name>
			<description>ITM Stimulus Port 29</description>
			<addressOffset>0x044</addressOffset>
			<size>32</size>
			<access>read-write</access>
		</register>
		<register>
			<name>ITM_SP30</name>
			<description>ITM Stimulus Port 30</description>
			<addressOffset>0x048</addressOffset>
			<size>32</size>
			<access>read-write</access>
		</register>
		<register>
			<name>ITM_SP31</name>
			<description>ITM Stimulus Port 31</description>
			<addressOffset>0x04C</addressOffset>
			<size>32</size>
			<access>read-write</access>
		</register>
		<register>
			<name>ITM_ENABLE</name>
			<description>ITM Port Enable Bits</description>
			<addressOffset>0xE00</addressOffset>
			<size>32</size>
			<access>read-write</access>
		</register>
		<register>
			<name>ITM_PRIVELAGE</name>
			<description>ITM Privelage Bits</description>
			<addressOffset>0xE40</addressOffset>
			<size>32</size>
			<access>read-write</access>
		</register>
		<register>
			<name>ITM_TRACE_CTL</name>
			<description>ITM Trace Control Register</description>
			<addressOffset>0xE80</addressOffset>
			<size>32</size>
			<access>read-write</access>
		</register>
	</registers>
</peripheral>
	</peripherals>
</device>
